{"id":"~0107f69f9c80c0c5f1","title":"Website WORDPRESS Work","snippet":"\n\nProject Scope\n\nSite Performance and Mobile\nSee attached Pagespeed Insights-mobile.html and Pagespeed Insights-web.html for details on required performance optimization and mobile optimization\n \nSite Content Optimization\n– Fix Missing H1 Tags\n \n– Shorten 221 Titles that are a too long (see existbi-duplicate-page-titles-content.csv)\n \n– Eliminate 287 Duplicate page titles (see existbi-duplicate-page-titles-content.csv)\n \n– Eliminate 101 duplicate page content (see existbi-duplicate-page-titles-content.csv)\n \n– Replace 9 Missing meta data tags (see existbi-duplicate-page-titles-content.csv)\n \n– Clean up 124 404 links (see moz-existbi-crawl_issues-404s.csv)\n \n– Add Accelerated Mobile pages\n \n– Replace address and phone number on site using Schema data (this allows Google to display your address in it’s listings)\n \n– Add rich snippet reviews (see here: https:\/\/developers.google.com\/search\/docs\/data-types\/reviews)\n \n– Add alt tags to images and rename image filenames using SEO –friendly convention\n \n– Fix missing meta-tag data (low priority – just effects how sub pages are displayed in search - see meta-tags.pdf)\n \nSSL\n \n– Ensure best practices have been followed for HTTPS forwarding and make any changes as needed\n \nSite Features\n \n– Embeds. Install and configure simple plugin to allow for easy embedding of YouTube and SlideShare content into pages and posts\n \nInternal Links\n– The .html postfix is a myth and has no SEO value. This plugin should be removed\n \n– It’s important to create a clear hierarchical structure for the internal pages and to cross link wherever possible. Pages should be linked both vertically and horizontally. Subordinate blog posts and articles related to each keyword are properly linked to top level landing page. E.G.\n \n– Places where target terms such as “Informatica Training” appear on internal pages, they should link to http:\/\/www.existbi.com\/informatica-training.html I recommend using an internal link generator for this.\n \n– Breadcrumbs should be implemented as well to reinforce the link hierarchy with Google\n \n– http:\/\/www.existbi.com\/informatica-powercenter-training.html must contain link referring to parent http:\/\/www.existbi.com\/informatica-training.html\n \n– Redefine link structure so that sub-pages are hierarchical. E.G. http:\/\/www.existbi.com\/informatica-powercenter-training.html should actually be http:\/\/www.existbi.com\/informatica-training\/powercenter-training.html\n \n– Cross-link ‘sister’ pages so that Informatica Consulting refers to Informatica Training page, etc. Utilize a plugin and establish business rules for automatic internal cross-linking.\nFix Structured Data Markup errors on 29 pages (See attached report)\n \nRich Cards -\n·         Create \"Course\" Rich Cards for Google search for our top 5 training programs:\n·         Tableau Training (6 courses)\n·         Informatica (20 courses)\n·         SAP Business Objects (10 courses)\n·         Microstrategy (11 courses)\n·         IB Cognos BI (8 courses)\n \nCreate \"Product\" Rich Cards for Google search for our 3 products:\n·         DWH Model - Banking\n·         DWH Model - Insurance\n·         DWH Model - Telecom\n\nMissing Links\nLinks these logos to their company pages\nhttps:\/\/www.existbi.com\/clients.html\n\nH1\/H2 Tags \n i.      Optimize all H1 headers and where needed, split into H1 and H2\nii.      Slightly increase font size of H1 tag globally and reduce font size of H2 tag to slightly smaller than H1.\n ","category2":"Web, Mobile & Software Dev","subcategory2":"Web Development","skills":["html","php","web-design","wordpress"],"job_type":"Fixed","budget":1250,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-29T22:10:22+0000","url":"http:\/\/www.upwork.com\/jobs\/~0107f69f9c80c0c5f1","client":{"country":"United States","feedback":0,"reviews_count":0,"jobs_posted":31,"past_hires":16,"payment_verification_status":"VERIFIED"}}