{"id":"~010f6285d17b222014","title":"Outstanding IT Support Assistant Required","snippet":"NOTE ONE: I am looking for individuals rather than a company.\n\nNOTE TWO: I am not looking for an individual who is working on multiple contracts. I want you dedicated to be working on MY contract!\n\nNOTE THREE: If you are looking for a 9AM to 5PM cushy job, THIS JOB IS NOT FOR YOU.\n\nNOTE FOUR: You will be required to sign a NDA.\n\n---------------\n\nWe are a small company, with 5 permanent staff. Due to growth we are looking to add a new member to our already solid support team!\n\nI am looking for an OUTSTANDING extensively knowledgeable IT Assistant.\n\nWe have approximately 50 new support requests per day and then replies to older tickets.\n\nWe have a dedicated support system built into our website via Kayako and an online chat system, so knowledge of Kayako support systems will be a bonus, however, any clued up IT person can use this. Within Kayako, we have a fair number of predefined replies so that a lot of questions are pre-answered, however, they also need to be maintained, added too, etc etc.\n\nIf the issue cannot be solved we also offer a remote installation facility for our customers via Teamviewer remote access software, which I can give you access to. You simply login to the customers PC and fix their issue for them remotely.\n\nI expect the following:\n\n- HONESTY <-- THIS IS PARAMOUNT\n- Fast reliable broadband connection, preferably a fibre connection (very important)\n- Available on Skype \/ WhatsApp\n- Solid IT troubleshooting skills\n- Excellent fluent English skills\n- Good understanding of WINZIP \/ WinRAR (extracting, etc)\n- Solid understanding of ISO files and mounting \/ unmounting them via MagicDisc \/ PowerISO\n- Solid Microsoft Office \/ Windows XP \/ Vista \/ 7 \/ 8 skills\n- Solid Mac OSX skills\n- Extensive knowledge of VMWare Player (installation + configuration + troubleshooting), this is very important\n- FTP \/ SSH skills\n- Cloaking links\n\nI am not expecting any Microsoft certifications, etc, etc, however, I am looking for someone very clued up on how to use computers and more than just the average copy and paste person!\n\nI expect the support assistant to be a fast learner and self-sufficient. For e.g. if you can't fix an issue, research it online. More often than not your answer can be found on Google. I always say this, \"USE YOUR INITIATIVE\". I am not here to baby you through!\n\nMy support software allows me to check how long you have spent on a support ticket and this is how you will be paid at the end of the week. For e.g. 1 week, you may work 9 hours, hence will pay you for 9 hours work. Another week, you may work 20 hours, I will pay you for 20 hours work. I will NOT go of what Upwork says since their system is clearly flawed!\n\nConsidering how well you do and how good you are with VMWare Player, I can potentially introduce you into building the software we do via VMWare Workstation.\n\nI expect this person, to communicate with other support staff via Skype.\n\nPassing the ticket to myself should be a last resort.\n\nAlso, this is not a job where you sit in front of the computer for hours and hours. Work when you want. Check the support tickets every hour \/ 20 minutes or so, if you wish. You can even do it via the mobile app, if you have an iPhone or Android phone, although these will be basic replies, as most of the time you may need to be in front of your computer.\n\nAbove all, I expect honesty, reliability, and someone with a passion and believe me you will be rewarded exponentially with bonuses, holidays, etc etc.\n\nThere is a lot of opportunities here for the right person.\n\nThis role is for 1 or 2 weeks to start with. You will be closely monitored by myself and my Senior Technical Support Analyst to see what you are capable off. WE WILL, throw you at the deep end and we will see how you respond!\n\nThis job isn't for any mickey mouse freelancer. It's a full-time job, WORKING AROUND the clock and being flexible. You will be part of a small dedicated team!\n\nThankyou and Good luck...","category2":"Customer Service","subcategory2":"Technical Support","skills":["english","ftp","ssh","vmware-administration"],"job_type":"Hourly","budget":0,"duration":"More than 6 months","workload":"Less than 10 hrs\/week","job_status":"Open","date_created":"2016-10-30T15:08:32+0000","url":"http:\/\/www.upwork.com\/jobs\/~010f6285d17b222014","client":{"country":"United Arab Emirates","feedback":4.962511212,"reviews_count":23,"jobs_posted":197,"past_hires":143,"payment_verification_status":"VERIFIED"}}