{"id":"~01024e30edbaaa0a52","title":"Events and Festivals - Web based NFC\/RFID ticketing systems, CRM, reporting","snippet":"Developing NFC\/RFID based TICKETING SYSTEM with web based CRM and reporting for Event\/festival Organizing businesses. \n\nOur target market are event and festival organizers.\n\nWeb Based System\n\nLooking for the web based system for event visitors to activate their NFC enabled wristbands online by registering their information online apart from that we are looking for ticketing. Concession and Retail POS(Desktop or web) application development for on premises of the event to handle cashless transactions using registered NFC wristbands. Looking for quite a lot reporting features to enhance the Event Organizer to have better analytics of events, attendees, etc., \n\nVisitors and event goers will use NFC enabled wristbands as tickets. No more paper tickets will be issued; eliminating ticket fraud. Event organizers will require visitors to register in advance. The wristbands will be mailed to the visitors and all visitors will be required to activate their wristbands online by registering their information. Once the wristbands are registered; the person will be allowed to “top up” their wristbands with money. They should be able to use their credit cards; paypal, etc. The NFC wristband will not only be their ticket to the event; it will also allow them to make cashless transactions to buy food; souvenirs, etc.\n\nReal-time Event Reporting\n\nWeb based cloud system will provide event planners with real-time and automated insight in the number of attendees and their identities on event site; saving time on patrolling and manual reporting. Able to handle much higher number of visitors. Visitors will be able to tap their wristbands at entrance gates or will be met by an employee at the gate who will use an RFID or NFC handheld reader to scan the attendees in and out. Real-time head count from all access points. Web based cloud system will log information on everyone attending (check in, check out times, etc.)\n\nCashless Payments\n\nWe will lease out NFC point of sale to vendors, sponsors of the events to enable visitors to make cashless payments using their NFC wristbands. Instant top-up, cancel, transfer, and refund. Balance checking. While people are enjoying and having a great time; our web based system will provide real-time insight in all vendor sales (at event). Integrated loyalty and point collection system. Fast and convenient way to pay; reducing queuing time by eliminating the process of exchanging cash or cards. Creating a cashless environment; that reduces theft. Real-time reporting allows instant staff relocation to hotspot areas. Track spending behavior of individual attendees. Automated and simpler account reconciliation for all the vendors.\n\nWeb based system will allow event planners to access information in real time from anywhere. Our system should be able to provide our clients (event planners) with powerful data to help clients make better decisions. For example; capacity reports, scanning reports, visitor check-in reports, time specific reports to track visitor flow, hotspot areas, generate both real-time and summary reports, spending behavior, gender, age group, etc.","category2":"Web, Mobile & Software Dev","subcategory2":"Other - Software Development","skills":["java"],"job_type":"Fixed","budget":5,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-30T17:08:16+0000","url":"http:\/\/www.upwork.com\/jobs\/~01024e30edbaaa0a52","client":{"country":"Canada","feedback":0,"reviews_count":0,"jobs_posted":4,"past_hires":0,"payment_verification_status":"UNKNOWN"}}