{"id":"~010a8c8e74f1e461ae","title":"Cold Calling\/ Appointment Setting\/ Phone Interview","snippet":"Director of Company in The United States.\n\nWe are looking for experienced call center or telemarketing agents \/outbound lead generation specialists to perform outbound cold calling, appointment setting and lead generation, with full daily call reporting. \n\nWe are looking for agents who are well spoken and very fluent in English with a good accent. You must speak English very well.\n\nWe need experts to call individuals who have filled out an application and set appointments and collect contact information.\n\nYou will have to use a short simple phone script to introduce us and confirm the contact information of each person (name, email, and direct phone number) so someone from our company can email them information. We will also need you to make one follow up call to each person to make sure they received the email and information.\n\nYou will need to notify each person at the end of the call that we will be emailing them some very important information. \n\nDetailed Task:\n\n1. Call each individual\n\n2. Introduce our company, do short 1-2 minute phone interview, and tell the individual that we will email them some information.\n\n3. Get the person’s name and email address, and the best time to call them to schedule a follow up phone interview.\n\n4. Call a minimum of 50 to 100 individuals in one day (possibly more)\n\nEach individual MUST know that we are sending them information via email, and be expecting to receive the information from us within 24 hours.\n\nWe need agents to be willing to communicate with us on a daily basis and also do a daily call via skype.\n\nThis is not a short-term job. We are looking for a hard working individual that wants a long term position with our company. \n\n\nRequirements and Qualifications:\n\nMust have a computer with Internet\nMust be able to work between the hours of 8:00am to 5:00pm Monday – Friday EST.\nMust communicate via Phone\nExcellent customer service skills\nMust have experience cold calling, setting appointments, or doing phone interviews\n\nPlease let us know if this is something you can do.\n\nIf you have experience, we would love to work with you.\n\nThank you","category2":"Sales & Marketing","subcategory2":"Telemarketing & Telesales","skills":["appointment-setting","b2b-marketing","cold-calling","lead-generation","outbound-sales","sales","telemarketing","telephone-skills"],"job_type":"Hourly","budget":0,"duration":"More than 6 months","workload":"Less than 10 hrs\/week","job_status":"Open","date_created":"2016-10-28T18:20:27+0000","url":"http:\/\/www.upwork.com\/jobs\/~010a8c8e74f1e461ae","client":{"country":"United States","feedback":5,"reviews_count":3,"jobs_posted":16,"past_hires":11,"payment_verification_status":"VERIFIED"}}