{"id":"~011bb276e8aaf5ff04","title":"Top VA for a Children's Author | Photoshop + HTML knowledge","snippet":"Hello YOU!\n\nI’m looking for a personal\/virtual assistant that will help me mostly with editing graphic work (not designing).\n\nAs a children's Author my vision is to inspire children and broaden their perception about challenges in life - so that in time they will have the right tools to handle almost every challenge they face in life.\n\nWhat YOU will do :\n============================\n\n* Editing Photoshop files of pages of the books \n(Extracting characters, working with layers, updating text layers)\n* YOU will learn how to use other programs to create ebooks from images (some HTML knowledge will be required)\n\n\nWhat key skills YOU need to do the job well:\n===================================\n*Great verbal and written communication in English.\n* Being SUPER attentive to details\n* html (especially layout knowledge)\n* Very skillful in Photoshop\n*Great organization skills - mostly in google drive, google spreadsheet and google doc\n* Fast learner and autodidact.\n* Very organized\n* Believes in my vision (written in the beginning) \n\n\n** Also I expect YOU to be available on Skype(also video calls)\\whats-app\\email\n\nMore skills YOU might have that can be an advantage:\n====================================\n\n* Understating of Graphic design CONCEPTS\n* Familiar with mail-chimp templates (or other email newsletter program)\n* Familiar with KDP select (Kindle Direct Publishing)\n* Experience in Amazon marketing.\n* SEO\n* Being a parent of a 4-10 year old who wishes to inspire his children\n* You like reading books to your children - especially the ones that delivers an important lesson.\n* You’re excited to get your children involved with this project (reading the books, commenting on them, etc.)\n\n\nWhat I expect from YOU:\n======================\nI expect you to fully read this application and address all the things written here- and of course explain me why are you the best fit for this position.\n\nThis is my amazon page - You’re more than welcome to give it a look:\nhttp:\/\/www.amazon.com\/A.-M.-Marcus\/e\/B00JSSM6UM\/\n\nOne of my books is usually on free promotion - so you can even download it for free and have a look at it. I would be HAPPY if you will also share your thoughts about the book.\n\nThis is my website: www.AMMarcus.com\n\n---------------------------------------------------------------------------------\n\n*If you feel this role is a good fit, and you want to apply, please let me know why with a few good reasons why I should pick you. My advice for you is to read this application once again and address all issues mentioned here- in your response.\n\n\n** Suitable candidates will be interviewed through Skype and be given some fixed price tasks for test.\n** Please mention in the beginning of your reply \"Children are the best\" so I know you read all of the job application (also if I invited you to apply).\n\n\nThank you for your patience and for taking the time to read this lengthy job application. I hope you will have a great day!\n\n","category2":"Admin Support","subcategory2":"Personal \/ Virtual Assistant","skills":["adobe-photoshop"],"job_type":"Hourly","budget":0,"duration":"More than 6 months","workload":"30+ hrs\/week","job_status":"Open","date_created":"2016-10-30T05:38:26+0000","url":"http:\/\/www.upwork.com\/jobs\/~011bb276e8aaf5ff04","client":{"country":"Israel","feedback":4.8539194104,"reviews_count":179,"jobs_posted":161,"past_hires":328,"payment_verification_status":"VERIFIED"}}