{"id":"~011e16db6f0049655c","title":"Research and Write Content for Digital Product","snippet":"Hi\nI am creating a digital product and have some specific pieces of research that need doing and writing up. I am looking for someone with clear communication skills and great presentation skills. Hours are flexible. I will set tasks by priority using Trello. I am open to dicussion of payment as a weekly retainer or a number of hours etc. I want to make this work for both of us.\n\nIf you are also good at creating infographics using venngage.com and using canva.com to show your creative side for in-article graphics and graphics that assist with explaining a concept - then you are just what I am looking for.  If you can use photoshop at a basic level then you will also be a great help to me.\n\nSome elements of my digital product have some pdf\/word document downloads.... so I am looking for someone who is happy to help me creating digital resources as well.\n\nI am not looking for one article to be written ... I am looking for someone to work with me long term. This is just one of 3 digital products that I have in progress and I simply do not have the time to produce all the content myself.\n\nSome of the content will be produced by discussing my requirements over skype to extract the knowledge from my head and put it into written format.\n\nIf you are happy to create some audio recordings as well, that may be very interesting.\nI hope you can see that I am looking for a good all round to help me create my exciting and professional products.\n\nAll content produced will be owned and copyrighted by me without exception so please don't apply otherwise.\n\nI have been a freelancer myself in the past and I believe in valuing people, their skills and clear communication as well as addressing any concerns or problems, so I think you will enjoy working with me. I am based in the UK so ideally if you are UK based that would be a real winner.\n\nLook forward to your applications. Thanks guys.","category2":"Writing","subcategory2":"Article & Blog Writing","skills":["article-writing","content-writing"],"job_type":"Hourly","budget":0,"duration":"1 to 3 months","workload":"Less than 10 hrs\/week","job_status":"Open","date_created":"2016-10-27T15:18:27+0000","url":"http:\/\/www.upwork.com\/jobs\/~011e16db6f0049655c","client":{"country":"United Kingdom","feedback":5,"reviews_count":2,"jobs_posted":3,"past_hires":3,"payment_verification_status":"VERIFIED"}}