{"id":"~011ca2b7be0b34231c","title":"CALLING ALL GAME MASTERS: D&D 5e Encounter Wanted","snippet":"What's up DMs?\n\nI'm looking to have a generic D&D encounter created that I can use as the basis for a new collection of GM-centered resources. This is Part One of what is meant to be an ongoing project with a larger scope.\n\nHere are my parameters:\n\n-The encounter should be suitable for a level 3 party\n\n-Be set in a non-specific location that most GMs would be able to work into their campaign\n\n-Use monsters that are common across most settings, or else are easily modified by the GM for their setting if their campaign is specialized\n\n-No NPCs or plotpoints that are anchored to a specific story line\/campaign (rather, the encounter should fit easily into other GMs' stories)\n\n-MUST Follow the guidelines set out by the Wizards of the Coast Open Gaming License for D&D 5e (available here: http:\/\/media.wizards.com\/2016\/downloads\/DND\/SRD-OGL_V5.1.pdf). The most common concern is with the Product Identity items on page one, paragraph four-- don't use any of those terms.\n\n-Must not be previously published anywhere else, original material only.\n\n-Must be a single encounter where the action is resolved when the players have killed all monsters, left the area, etc. Save your creativity, dungeon crawls, and multi-part encounters for later on.\n\n-There must be combat involved.\n\nIn terms of areas to cover in the material, here are the general sections (please also see the attachments for an example):\n\nEncounter level (and is it scales up or down, the range of the encounter)\nTerrain type\nRaces, classes, and\/or feats that have advantage in this encounter\nRaces, classes, and\/or feats that have disadvantage in this encounter\nHow hard the encounter would be\nCreatures Summary & Profiles\nRewards Summary\nCreature tactics\/behavior\nSuggestions for scaling the adventure up or down to accommodate different PC levels or party sizes\n\nIn terms of length, I only expect it to be complete in terms of giving a GM what they need to use the encounter. I prefer short and functional to long and flowery.\n\nIf you have any questions or clarifications, I'm happy to answer as best I can.\n\nThanks!","category2":"Writing","subcategory2":"Creative Writing","skills":["content-writing","game-design","game-testing","ghostwriting","writing"],"job_type":"Fixed","budget":7,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-30T01:27:07+0000","url":"http:\/\/www.upwork.com\/jobs\/~011ca2b7be0b34231c","client":{"country":"United States","feedback":0,"reviews_count":0,"jobs_posted":1,"past_hires":0,"payment_verification_status":"UNKNOWN"}}