{"id":"~01194a3d345ca18d10","title":"American neutral voice over... MALE PLS","snippet":"I need to get around 2 min voice over. Please send me your samples of the narration given below. Just few lines.\n\nScript\/VO\nThe Modern world needs enterprises that can bridge the need for quality and most\nimportantly the need to nurture. Greentech is one such enterprise that believes in quality\nand understands the evermore need to nurture and develop in terms of people and in termsof process. We are proud to be the official business partners of Samsung and Lenovo mobile phones in Pakistan.\n\nWith a humble beginning in 2012, we started our journey from one city with just 25\nemployees and 85 dealers, we have steadily grown over the years\n\n2012\n2013\n2014\n2015\nand today this partnership yields around 400 direct employees, a nationwide presence in\nover 100 cities with more than 1000 dealers and offices in 6 major cities. Our corporate\nclient portfolio includes major Telcos, Multi nationals and Banks. Green Tech now holds the majority market share of Samsung mobiles in the territory. We are also the authorized\npartners for Samsung official phone accessories.\nWe care for our consumers and therefore we have developed a reliable customer care\nnetwork with over 250 collection points and 17 service centers across the country.\nWith 90% of the employees between 25-35 age group, growing number of female\nemployees presently at 10% of the total greentech family and more than 50% of employees with a 5+ year’s experience, in the their respective domains. We are dedicated to deliver innovation and quality that helps penetrate new markets, regions and continue to enrich the connected experience.\n\n\nRegards","category2":"Design & Creative","subcategory2":"Voice Talent","skills":[],"job_type":"Fixed","budget":50,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-27T20:53:35+0000","url":"http:\/\/www.upwork.com\/jobs\/~01194a3d345ca18d10","client":{"country":"Pakistan","feedback":4.9666666667,"reviews_count":3,"jobs_posted":29,"past_hires":7,"payment_verification_status":"VERIFIED"}}