{"id":"~011f8c998833f89eaf","title":"News Content Crawling & Analysis","snippet":"News Content Analysis\nWe’re looking to do a regular analysis of our news site’s content versus a few key competitors.  We’re looking for someone to create a report comparing different aspects of our content from textual analysis to date\/time.\n\nReport Requirements\nGiven a list of 4-5 news websites and looking at the last 30 days create a report comparing the sites and individual reports for each site.\n\nComparative Report\n•\tSite’s Average Posts per day – each site’s average number of posts per day\n•\tSites’ Average Shares per article – each site’s average number of shares per article during time period  (eg. SiteX has 100 articles with 1000 shares total, Site X has average of 10 shares per article)\n•\tSite’s Average Comments per article – each site’s average number of comments per article (NOTE: this may be too difficult to include, please let us know if it is and we can remove this requirement)\n•\tSites Posts by day of week - bar graph of each site’s average number of posts for each day of the week  (eg. SiteX posts on average 7.3 articles on Monday, site Y on average posts \n•\tSites’ Posts by hour of day – bar graph of each site’s average number of posts for each hour of the day (e.g. SiteX posts on average 2 articles in the 9am hour, SiteY posts 4) Note: look at each site to normalize the timestamp’s timezone to US Eastern time\n•\tTop 5 most shared articles per site (list by site, with article title & count)\n•\tTop 5 word cloud words from each site (see site report)\n\nSite Report (For each site)\n•\tAverage Posts per day - just like comparative report, but with only this one site showing\n•\tAverage Shares per article – just like comparative report, but with only this one site showing\n•\tWord Cloud – analyze the full text of all articles and create a word cloud for each site.  Be sure to exclude stopwords and we may create custom stopwords that are shared across all sites\n•\tTop 25 Most Shared Articles – shared on facebook \n•\tPosts by day of week – just like comparative report, but with only this one site showing\n•\tPosts by hour of day – just like comparative report, but with only this one site showing\n•\tPost per author – a pie chart of all articles by author during time period\n•\tTop Author Names -  a list of the top 5 authors by article count\n•\tTop Shared Authors – a list of the top 5 authors with highest average share per article\n•\tTop 25 most commented on articles\nTechnical considerations\n•\tYou’ll need to crawl the sites for this info, some may be available by RSS, but we need all articles back 30 days\n•\tYou’ll need to fetch the share count from facebook.  See: https:\/\/developers.facebook.com\/docs\/graph-api\/reference\/v2.8\/url\n•\tWe may want to run this report from time to time, so let us know how we might do that (if it’s code that can be installed on a simple hosting account, or uses third party service, etc).\n","category2":"Data Science & Analytics","subcategory2":"Data Extraction \/ ETL","skills":["data-analysis","data-scraping"],"job_type":"Hourly","budget":0,"duration":"Less than 1 month","workload":"Less than 10 hrs\/week","job_status":"Open","date_created":"2016-10-30T22:15:03+0000","url":"http:\/\/www.upwork.com\/jobs\/~011f8c998833f89eaf","client":{"country":"United States","feedback":4.9852169414,"reviews_count":11,"jobs_posted":37,"past_hires":34,"payment_verification_status":"VERIFIED"}}