{"id":"~0118c479f268acf9bf","title":"Unique Status Code Checker - Interesting Development Problem","snippet":"I have an interesting problem for a talented web developer.\n\nI run the website URLChecker.org. This site checks whether file sharing links are alive or dead plus scrapes file sharing links off source pages.\n\nIt is a legitimate service which many online piracy protection agencies use to both find and check the status of infringing links.\n\nRecently, we've run into problems with folder links on mega.co.nz.\n\nAn example of these links would be the following:\n\nhttps:\/\/mega.nz\/#F!YlQ3hTpI!vVWThlol97GK5umZbaWLWw\nhttps:\/\/mega.nz\/#F!LgByTZAY!4qT6f7uFinZvMr24YQtfdg\n\nFolder links can be identified by the \"#F\" characters.\n\nBoth of these links are now dead however, my current developer has been unable to find a way to check the status of folder links. This is because, according to my developer \"mega.nz doesn't provide documentation or provide an api for get folder status. Mega.nz also encodes all requests.\"\n\nRegular links return either an \"alive \/ dead\" status. An example of a regular link would be:\n\nhttps:\/\/mega.nz\/#!iMEC2TBA!bEHWqvjSCid0_DDCdku0gnUpAhRNeZ5JH7rKP5quIfc\n\nIf you run this through URLChecker.org you'll see it comes back as \"dead.\n\nWe would like to do the same with folder links.\n\nMy developer has tried a number of solutions including testing https:\/\/github.com\/megous\/megatools. However, he has been unable to come up with a solution.\n\nIf you are interested in applying for this job and helping us solve this issue, please do the following:\n\n1.) Write at the top of your job application \"I understand the problem with mega.nz\". This is an anti-spam tactic designed to identify people who just recycle cover letters without reading the job posting.\n\n2.) Briefly explain how you would solve our problem.\n\nMoving forward I'm looking to take on a new developer to help with development of the website long term and also several other related projects. So for the right candidate, this could turn into a longer relationship with more work.\n\nMany thanks and I look forward to receiving your bid.\n\nRegards,\n\nAlastair Evans\n\n\n\n\n\n\n","category2":"Web, Mobile & Software Dev","subcategory2":"Web Development","skills":[],"job_type":"Hourly","budget":0,"duration":"Less than 1 month","workload":"Less than 10 hrs\/week","job_status":"Open","date_created":"2016-10-29T05:00:34+0000","url":"http:\/\/www.upwork.com\/jobs\/~0118c479f268acf9bf","client":{"country":"Japan","feedback":4.8665656954,"reviews_count":101,"jobs_posted":182,"past_hires":189,"payment_verification_status":"VERIFIED"}}