{"id":"~011645543541b0d76b","title":"Salesforce CRM Strategy & Development Leader","snippet":"Social Garden was founded in 2013 and is a pioneer in the predictive demand generation market that utilizes emerging marketing automation technology, social and big data to scale organisational EBITA and revenue.\n\nThe business has grown from 3 founders, to a team of 35 in three years and is led by a dynamic young team of thought leaders in the growth hacking, data analytics and marketing automation sector. \n\nWe have a strong Phillipenes based team that we have worked with for the past three years.\n\nThe Role\n\nYou will be responsible for working with our Australian based Salesforce team to build and manage our offshore CRM operations as well as drive key client strategy and development.\n\n\n•\tUtilise client CRM systems to identify areas to improve your client’s results\n•\tMentor and support junior CRM developers and marketing automation producers\n•\tWork with management to develop and optimise client strategy\n•\tKeep project management software (Asana) up to date at all times\n•\tTrack time against jobs with a focus on efficiency\n\nAttributes and Abilities\n\n•\tPassionate about digital marketing and high growth companies\n•\tUnderstanding of digital marketing technology and audience segmentation\n•\tSelf-motivated and a commitment to personal development \n•\tProactive, positive attitude and a kind spirit\n•\tStrong communication skills with excellent English\n•\tRidiculously high attention to detail\n•\tStrong ability to identify and solve problems within the client’s customer journey\n•\tProven ability to work collaboratively in a fast-paced, team environment.\n•\tHungry for career progression - we are growing quickly & want you to grow with us\n•\tExperience in real estate sector, advertising\/media\/technology companies (preferred)\n\nExperience\n\n•\t3+ years working in a Salesforce strategy and implementation leadership\n•\tCertified Salesforce developer (preferred)\n•\tCertified Salesforce administrator (preferred)\n•\tExperience in Salesforce Administration - user management, Salesforce setup, workflow processes, formulas (for validation rules etc...)\n•\tSignificant experience integrating Salesforce into third party applications and programs\n•\tExperience working with the marketing cloud - Marketo, Pardot, Exact Target \n•\tExperience gathering CRM requirements, developing and executing strategy\n\n\nWhat We Bring to the Table\n\n•\tBuild something you can proud of. We are a high-growth company scaling quickly\n•\tBRW Fast Starters 2015 (fastest 100 growing companies in Australia)\n•\tImpact to business. This is a critical role and your job is key to our success. \n•\tEnormous potential for success. With this job you have the full playing field to find new    opportunities within the market. \n•\tYou have strong executive support, mentorship and a great team to help you build and execute\n•\tThe talent you'll meet. Our team are some of the brightest young minds in our industry and we take great pride in the amazing work we collectively deliver to our clients.\n•\tThe team we're building. We have a great team that works hard and has a lot of fun along the way. We will continue to pack the office with passionate, exceptionally talented people that believe in our vision and embody our values.\n•\tOur impact. We're disrupting business models that have not changed in decades. We're building something special, and will bring a new level of talent to the Australian marketplace.\n","category2":"IT & Networking","subcategory2":"ERP \/ CRM Software","skills":["crm","exacttarget","marketo","pardot-development","pardot-marketing","salesforce.com"],"job_type":"Hourly","budget":0,"duration":"More than 6 months","workload":"30+ hrs\/week","job_status":"Open","date_created":"2016-10-27T23:10:27+0000","url":"http:\/\/www.upwork.com\/jobs\/~011645543541b0d76b","client":{"country":"Australia","feedback":4.9969499927,"reviews_count":37,"jobs_posted":110,"past_hires":66,"payment_verification_status":"VERIFIED"}}