{"id":"~0128f3b12dfc3ee44c","title":"French E-Commerce Marketing Specialist,4 Hours a Day,Long Term","snippet":"IMPORTANT: note that if you are not a French native or fluent speaker, your proposal will be reported to Upwork as spam.\n\nWe are looking for E-Commerce Marketing Specialist for our French websites:\n\nlightinthebox(dot)com(slash)fr\nminiinthebox(dot)com(slash)fr\n\nThis is a fixed position working from home, 5 days a week, 4 hours a day, going on indefinitely. The salary is negotiable,we could talk about this after interview.Please consider this when you apply, don't send us a proposal if you are just looking for a short term or temporary job.\n\nYour role:\n1)Take responsibility of collecting and analyzing target website’s  information\n2) Involved in advertising copywriting and post company’s promotion information on various forums to improve exposure rate and sales volume\n3) Maintain and manage company’s social homepage and official accounts \nWhat you’ll need to succeed\nTo succeed you should ideally possess the following:\n1)Be interested in e-commerce and often shopping online ,have a good overall knowledge of crossborder e-commence\n2)Be active in and know well about social media \n3)Possess excellent written skill\n4)Be analytical and creative\n5)Internet sensation will be strongly encouraged to apply\n\n\nAPPLICATION REQUIREMENTS\n\nPlease don't send a boilerplate proposal, we will discard those immediately. Have a look at our sites and let us know what you think. You can of course tell us about your experience, but please emphasize how it's relevant to this position.\n\nAgain, this is a fixed, long-term position, please don't apply if you are not fully committed to working with us for a long time.\n\nStart your proposal with \"I have read the job description fully and I understand and agree to the job conditions and payment\", this will let us know that you have carefully read the whole job post. With your proposal please include:\n\n1) Your CV(In English);\n2) Your E-mail address;\n3) Your Skype ID.\n\nAlso,if you are interested in our opportunity,please contact our Marketing Dept leader Ms.HUANG directly for more information.\nHer Skype:alta.schnabel.wolseley\nHer email: huangli@lightinthebox.com  \n\nGood luck for your application!\n","category2":"Sales & Marketing","subcategory2":"Other - Sales & Marketing","skills":["french","social-media-marketing"],"job_type":"Fixed","budget":5000,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-28T09:47:22+0000","url":"http:\/\/www.upwork.com\/jobs\/~0128f3b12dfc3ee44c","client":{"country":"China","feedback":4.4538228123,"reviews_count":41,"jobs_posted":556,"past_hires":389,"payment_verification_status":"VERIFIED"}}