{"id":"~012e1b9bdb9dea291d","title":"Create a spreadsheet of leads: companies hiring welders in USA","snippet":"We're looking to create a spreadsheet of leads: 4,000 different companies that are posting jobs looking for welders. We will be targeting top US cities, and the process is very simple:\n\n\nFor every city on this list [1], search for \"welder\" on the following job sites: \n\n- http:\/\/www.indeed.com\/\n- https:\/\/www.monster.com\/\n- http:\/\/www.jobs.com\/ \n\n\nThen for every job with a unique employer (important - no duplicates!) put down the name of the company, the e-mail contact address, and the link to the job. The attached example spreadsheet has a few examples. Often you will have to do a quick google search  of the company to get their email, if it isn't in the job posting.\n\n\nNote: we have a list of top 100 most populated cities to go off that we'll be using: \n\n[1] - https:\/\/en.wikipedia.org\/wiki\/List_of_United_States_cities_by_population \n\n\nThe ideal distribution of leads looks like this: \n\n- 100 leads from each of the top 10 cities \n- 50 leads from cities ranked 10 - 50 \n- 25 leads from remaining cities until we hit 4,000 leads\n\n\nNotes: \n\n- If you run out of leads from a city, just move on to the next. \n- Most leads require a quick google search of the company name to find their website and email. Please make sure you get the right company when googling (e.g. do \"[company name] [city]\")\n- ONLY include leads where you can find an e-mail address! \n\n\nTIMELINE:\n\n\nWe are looking to collect the 4K leads within 1 week of starting the contract.\n\n\nBONUSES: \n\n\nAfter the first 4,000 leads are collected, we will be willing to extend the contract, and pay additional $50 per each extra 1,000 leads. \n\n\n","category2":"Sales & Marketing","subcategory2":"Lead Generation","skills":[],"job_type":"Fixed","budget":200,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-29T17:43:05+0000","url":"http:\/\/www.upwork.com\/jobs\/~012e1b9bdb9dea291d","client":{"country":"Canada","feedback":5,"reviews_count":4,"jobs_posted":4,"past_hires":4,"payment_verification_status":"VERIFIED"}}