{"id":"~012c6b9b9fc1b8d044","title":"Programming for Passion: A Hope for Domestic Violence & Ending Slavery at Home","snippet":"We are going to work together to change the life of one woman, and hopefully the lives of many trapped at home.  Let me explain the start of this project, last Thursday night:\n\nShe was raped, twice, she said.  Before those two traumatic episodes, her sexual abuse started when she was a kid, done by her own uncle.  Just the night before we met she tried to kill herself ... take her own life, but her 14 year old son found her lying on the railroad tracks.  She looked at him, and realized she wanted to live, and just a couple minutes later, a train came.  That's when the police got involved, and brought her to the emergency room.\n\nShe then held out both hands and said, I can count on both of these hands the number of times that my husband has allowed me to leave my own home in the last three years.  I'm not allowed to have any friends, or take a job, because he fears that I will cheat on him.  The last time I was in the hospital, he accused me of sleeping with the staff, even as I was laying immobile in a bed with IVs in my arms.\n\nShe said she was banned from her church, because her first child was out of wedlock.  So I told her that there were other churches that would take her.  I asked her, \"Do you want to go to church?  Do you want to make new friends?\"  \"Yes!\" she said.  I gave her my phone number and she later called me to ask for a favor: she needed $80 to buy simple items like toilet paper, diapers for her two year old, and some soap \/ shampoo because they were all out at home.  So I called our community fund and got her these items, and delivered them before her husband got home.  She said she would see me at church... but this morning I texted the number and got a reply, \"I think you have the wrong number.\"  So we called the police to do a wellness check... however, he hasn't physically abused her... it's all verbal \/ emotional.  So they couldn't do anything... and she didn't get to go to church today.  She stayed locked in her home.\n\nIt is because of her that I need your help to program a very simple website.\nI just purchased the website \"Hip.Church\" and the goal is to teach hip pocket classes, based on something I learned in the Marine Corps during my military service.  She couldn't make it to church, so we're going to bring church to her... non-denominational, available for anyone of any religion, belief, or walk of life.  We are going to walk the neighborhood where she lives with tens of people volunteering to show her that she can join us, right outside, to come and walk with us, learn, listen, grow, connect, and be human again.\n\nThe goal is simple: walk around a neighborhood for an hour, and have five 7 minute classes taught by volunteers in the community.  They can talk about anything they want to share... science, art, music, life skills, finance... Then for 3 minutes in between each talk we will stop, say a prayer, and introduce the next teacher as we walk around.\n\nWe need a simple way to map out these interactions, and also allow the community to text in with their needs.  We know that there are more women stuck at home like this, and we want to use Twilio API to collect inbound text messages that ask them what address they are at, and ask them what they need, even for basic items like shampoo, soap, diapers, laundry detergent, etc.  We want to map this out and let the community respond to these needs, to bring them as they walk by on a Sunday afternoon, and just walk through neighborhoods sharing knowledge.\n\nWe want a way for anyone to start a Hip Pocket Class in their community, and lead a group of people to walk around their neighborhood, drop off items to those people in need, and share the requests for donations.  We want to work with local law enforcement to ask them where the \"Wellness Checks\" are occurring so that we can plan better walking routes.  The hope is that these women will look outside their windows and see a group of twenty, thirty maybe forty people outside... and they will feel empowered to join this group walking around, get away from their oppressive husbands or anyone else trying to control them, and eventually volunteer themselves to help other women stuck in this tragic form of \"legal slavery\" that is simple unacceptable.\n\nIf you find this issue close to heart, I hope you will be willing to accept a small donation to help us get this started.  As we get more donations, we can pay you for the additional time that you contribute to this project.  If you would like to help though, women around the world need your help, and I know this project will benefit them once we get it completed.  My company can donate a server to get the project up and running, or we can use Heroku temporarily.\n\nPlease let me know if you're willing to help!  Thank you for your kindness and generosity.","category2":"Web, Mobile & Software Dev","subcategory2":"Web Development","skills":["ruby","ruby-on-rails"],"job_type":"Hourly","budget":0,"duration":"More than 6 months","workload":"10-30 hrs\/week","job_status":"Open","date_created":"2016-10-30T23:09:14+0000","url":"http:\/\/www.upwork.com\/jobs\/~012c6b9b9fc1b8d044","client":{"country":"United States","feedback":4.9148747695,"reviews_count":19,"jobs_posted":31,"past_hires":41,"payment_verification_status":"VERIFIED"}}