{"id":"~012bc289d6608f08af","title":"Website & Software QA Tester","snippet":"The Areli Group, a growing, virtual agency is seeking a talented individual who has quality assurance experience and is able to work remotely on a freelance contract 1099. The ideal candidate would have 10-20 hours per week available coordinating responsibilities and duties with Areli’s team of Project Managers. \n\nIn this role, the Quality Assurance Engineer will provide The Areli Group QA department with technical vision and methodology for test automation, repeatable test process, and overall test engineering best practices for both website and software application developments.\n\n\nResponsibilities:\n\n- The individual will work closely with the software application developers and product management team to help deliver timely product releases that effectively meet our customer's needs and user experience.\n- Providing all stakeholders with appropriate regression reports in a timely manner.\n- Create User Stories for streamlining application testing.\n- Analyzing business problems and developing test plans and solutions to resolve these issues.\n- Evaluating testing tools and stacks.\n- Automating tests while collecting, tracking, and analyzing quality metrics on how to improve performance.\n- Preparing for sprint planning by understanding the details (effort, risk, priority) of remaining work committed for an update.\n- Contributing ideas for continually improving the team’s productivity, job enjoyment, and code quality.\n\n\nRequirements:\n\n- Knowledge of software quality assurance processes and experience with maintaining regression test suites.\n- Experience in test automation and working in the agile methodologies (Kanban, Scrum).\n- Experience with security testing.\n- Demonstrated ability to effectively establish and maintain working relationships with all levels of the organization.\n- Keen business judgment, focus, and ability to see the \"big picture\" and prioritize.\n- Excellent communication and presentation skills with the ability to present and translate complex information to both internal and executive teams in relevant business terms.\n\n\nKnowledge in the following are a plus:\n\n- Hands-on expertise with Java, PHP, or other programming languages.\n- Experience with automated build tools like Gradle, Maven, Grunt, etc. and UI testing tools like Selenium.\n","category2":"Web, Mobile & Software Dev","subcategory2":"QA & Testing","skills":["automated-testing","functional-testing","manual-testing","mobile-app-testing","performance-testing","php","selenium","selenium-webdriver","software-qa-testing","software-testing","usability-testing","web-testing"],"job_type":"Hourly","budget":0,"duration":"More than 6 months","workload":"Less than 10 hrs\/week","job_status":"Open","date_created":"2016-10-28T15:10:15+0000","url":"http:\/\/www.upwork.com\/jobs\/~012bc289d6608f08af","client":{"country":null,"feedback":0,"reviews_count":0,"jobs_posted":19,"past_hires":7,"payment_verification_status":null}}