{"id":"~0126843e624c70edd3","title":"I need a researcher and content writer to write 4 blog posts and articles","snippet":"Our business is growing and that means we’re looking for a rockstar researcher and content writer to join our team! \n\nDo you love to research and write awesome content (750 - 1,500 words) on small business topics (marketing, sales, leadership, entrepreneurship, team culture, online business, etc)?\n\nWe’re looking for a rockstar content writer to help us create quality content for us and our clients. Ideally you have copywriting skills (know how to choose an attention-grabbing headline and create \"tweetable\" quotes from your content), and know how to optimize content for SEO so it's found in Google.  \n\nOur clients are small business owners who are looking to elevate their profile and attract more high quality clients online.\n\nWhat’s in it for you?\n- $15 USD per content piece (each piece is up to 1500 words, with a max of 4 pieces per month per client)\n- Opportunity to practise your craft with an actual business client\n- Work with a fun and inspiring distributed team\n- Ongoing feedback, coaching and guidance to improve your writing and content marketing skills\n- Access to our training materials and learn about how to improve marketing for small businesses\n\nHow we work:\n1. We use Trello to assign topics and track progress of each content piece, so you will need to be willing to use Trello whilst working with us.\n2. For each blog post you will need to create draft in google drive and share the link with me when draft is ready. (Make sure I can edit so I can leave comments and feedback)\n\nThis will start off as casual contract role, with a view to making it part-time or full-time role as we continue to develop and bring on more clients.\n","category2":"Writing","subcategory2":"Other - Writing","skills":["article-writing","blog-writing","content-writing","copywriting","creative-writing","editing","internet-research","proofreading","seo-keyword-research"],"job_type":"Fixed","budget":60,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-28T05:07:57+0000","url":"http:\/\/www.upwork.com\/jobs\/~0126843e624c70edd3","client":{"country":"Australia","feedback":0,"reviews_count":0,"jobs_posted":9,"past_hires":3,"payment_verification_status":"VERIFIED"}}