{"id":"~01339156760f477c0f","title":"Hiring An Awesome Back-end Full-Time Engineer (Remote for an NYC based Profitable Startup)","snippet":"I’m looking for a back-end engineer who gets excited by challenges. \n\nNOTE => There are a bunch of conditions in here, only people who have read them and feel eligible should apply. Candidates from agencies may apply but only if they are looking to join our team as a full-time member. We're not looking for a contract worker. And able to communicate over a voice call is a must.\n\nI’m the CEO and co-founder of a data-driven marketing and analytics platform. I’ve been building this company for 5 years. We’ve been very profitable for more than 1 year. And the technology that we’ve built is actually able to steal customers away from our competitors who have 10x the development man-power that we do. \n\nI have a technology background myself and I work closely with my current two and a half developers. As our technology is scaling though, I've realized that we need a backend engineer with more experience, to step in and really make a mark! \n\nThere's a lot of room for growth in this company. The project is constantly evolving and becoming more interesting and complex as time goes on. You won't find yourself working on the same crap for years. Each month you'll be involved in new and exciting pieces of the puzzle that we're building. \n\nOur stack is Python\/Django\/AngularJS, we use Redis\/Memcache\/Postgresql\/ElasticSearch and use celery for messaging. We have a 22 node cluster hosted on AWS and Digital Ocean. \n\nI’m looking for a developer who has deep expertise in scaling large data systems. And as I mentioned above. The projects are constantly shifting because we’re continually evolving our platform and our capabilities. And because of this, the ideal developer is hard to describe in terms of exact languages and skill sets. Instead… we’re looking for someone who enjoys venturing out into new territory… and who will be able to master whatever is thrown at them. \n\nEach project we tackle is unique and requires thinking outside the box. And at a surface level, the problems might seem simple but the complexities arise when you dig deeper and scale. And that’s what we’re looking for in our next hire. Someone who thinks outside the box, produces clean and reusable code, and is looking to come up with unique algorithms.\n\nAdditionally, we're looking for engineers that are customer focused, collaborative, and excited to pursue difficult, often loosely defined problems.\n\nIf you like challenges. And you get excited by venturing into the unknown… let me know! I’d love to discuss further.\n\nIf this sounds interesting, here is an example of a problem that we have solved already : If you are given a random set of product urls, design a system that can automatically identify : the brand name, the product name, the image url, and the price. \n\nHere are three sample urls :\nhttps:\/\/www.jcrew.com\/womens_category\/shirtsandtops\/topsblouses\/PRDOVR~F1413\/F1413.jsp \nhttp:\/\/www.neimanmarcus.com\/Theory-Jemoine-Embroidered-Linen-Dress\/prod188780678\/p.prod?ecid=NMCS__GooglePLA&gclid=CPX1jNvG6s0CFcYehgod5x4MvQ\nhttp:\/\/us.topshop.com\/en\/tsus\/product\/twist-back-maxi-dress-5667034\n\nThis problem is difficult because :\n-all ecommerce sites have different and arbitrary structures. \n-identifying which text is the real price and not the sale price is hard. \n-many sites will put suggested products below the main product, so simply scraping the page for an image or a price will not work because we need figure out which product is the real product vs. the suggested products.\n\nThis problem requires a combination of techniques in order to extract this data correctly. And this particular problem is just one of many projects that we're working on, so I need to make sure that you are able to think about complex tasks.\n","category2":"Web, Mobile & Software Dev","subcategory2":"Web Development","skills":["big-data","django-framework","web-scraping"],"job_type":"Hourly","budget":0,"duration":"More than 6 months","workload":"30+ hrs\/week","job_status":"Open","date_created":"2016-10-27T19:56:49+0000","url":"http:\/\/www.upwork.com\/jobs\/~01339156760f477c0f","client":{"country":"United States","feedback":5,"reviews_count":2,"jobs_posted":48,"past_hires":23,"payment_verification_status":"VERIFIED"}}