{"id":"~0134bc434152bfa131","title":"Address Mapping","snippet":"Need mapping of several hundred addresses for multiple maps with markers through use of Google Maps. All addresses are currently collected in an Excel sheet. Work is already in progress and need someone to continue with it, have examples of what we need exactly. \n\nBasically the project will go in phases:\n1. Plotting the location addresses we currently have in our data \n2. Deciding which areas are too clustered and will need \"zoomed in\" segments, like cutouts of metro areas \n3. Then assigning a number pattern to the data points to plot (e.g. all data points in the southwest region of this state will be 01-49, and all data points in this city that's in that region will be 50-99). The Excel file will then be edited to represent this (i.e if they're in the state of Illinois section of the file, and they find #3 on the list at 123 Park Drive, then the graphical marker on the map at 123 Park Drive should have a number 3 above it to signify the connection)\n4. Plotting the markers on the map(s) with now assigned numerical pattern. \n\nThe overall goal is: To have a map someone can look at, find a number marker on that map, then go through an associated worksheet and easily find the address associated with that number. \n\nSo to reiterate overall what we need from a hiree: Google Maps with numbered markers, and excel data sheets that contains the addresses associated with the numbers, for each map we plan.\n\nAttached is an example of a mapping project done, we would like future mapping to be identical to this style. ","category2":"Data Science & Analytics","subcategory2":"Data Visualization","skills":["arcgis","cartography","data-mining","data-modeling","gis","google-maps-api"],"job_type":"Hourly","budget":0,"duration":"3 to 6 months","workload":"10-30 hrs\/week","job_status":"Open","date_created":"2016-10-27T22:35:17+0000","url":"http:\/\/www.upwork.com\/jobs\/~0134bc434152bfa131","client":{"country":"United States","feedback":5,"reviews_count":8,"jobs_posted":74,"past_hires":70,"payment_verification_status":"VERIFIED"}}