{"id":"~013bf6392f59155acf","title":"Help required to polish and enhance a team analysis survey","snippet":"I'm looking for an experience survey designer with analytical skills and some big corporate experience.\n\nI've designed a team analysis tool that has 72 questions across nine categories. Each question can be scored from 1-5 (never to always). \n\nFrom an initial set of responses (limited to just 13 teams) it seems the results are based towards repossess, 2,.3 and 4. I really need a greater spread of responses in order to differentiate each of the teams. \n\nWe use the data to cross reference against a teams's KPIs and aim too extract insights - to do this we a decent spread of results that actually shows something rather than all with very similar averages. \n\nThe work is currently being mocked up in Qlik Dashboards via an Upworker. The results look great but we had to play around with the mock data to make the 'story'. I need to ensure we don't have to do this with client data. \n\nJob 1 - is to help me polish and finesse the work that has already been completed and ensure the work delivers what we need.\n\nJob 2. We are going to add an 'admin' section at the start of the questionnaire. This will include questions to identify the team and its position within the company hierarchy. I want help with this and also to compile a list of other questions that will drive additional insights for the company and us.\n\nI look forward to your thoughts.\n\nI'll be happy to share the data and outputs once the right person has been selected. Ideally, this will be via Skype tomorrow. \n\nI need this completed today or tomorrow if at all possible.\n\nIf this works out well, then I reckon there will be further development work on this survey going forward.\n\nCheers\n\nMark.","category2":"Data Science & Analytics","subcategory2":"Data Visualization","skills":["data-mining","survey-design"],"job_type":"Hourly","budget":0,"duration":"Less than 1 week","workload":"Less than 10 hrs\/week","job_status":"Open","date_created":"2016-10-30T12:49:43+0000","url":"http:\/\/www.upwork.com\/jobs\/~013bf6392f59155acf","client":{"country":"United Kingdom","feedback":5,"reviews_count":18,"jobs_posted":73,"past_hires":48,"payment_verification_status":"VERIFIED"}}