{"id":"~0130b54f514a9df4f1","title":"Collect pictures of plant damages with your own Android Phone","snippet":"We are a startup focussing on image recognition software for plant diseases. We want to increase our dataset and need pictures of crops, vegetables and fruits affected by pests or diseases. We have a mobile app you may take images with, which are then uploaded to our server as soon as you have a wifi connection.\n\n\nWe are looking for people that are willing to help us collecting pictures. You would need to have a basic understanding of agriculture and it would be great if you have an ag-extension network or field trials in your surrounding. We are focusing on all basic crops but not on ornamental crops. We would pay by hour but would expect that you collect several hundred images in one hour, Gatherix has a counter that will tell you how many pictures of damaged crops you took. The function flow is very easy, you first choose the crop, then the pest or disease and then the cam will open and you are ready to take pictures (5-10 of every leaf or fruit from different angles) \n\n\nTo summarize, your job would be to download our private Android app “Gatherix”, then walk through the fields, talking to agricultural experts and make hundreds to thousands of pictures. You don’t need to upload them by hand, as the upload will be triggered automatically after your phone has Wifi. We don’t have an iOS Version for “Gatherix” yet, hence it necessary that you have your own Android Phone with at least Version 4.4, a 3mp Camera + enough free space for hundreds of pictures. We are especially interested in tropical agriculture and it’s main crops. \n\n\nSounds interesting? Please write us a message with your background and why you think you are the right person for this job. \n\n\n \n","category2":"Design & Creative","subcategory2":"Other - Design & Creative","skills":["agriculture"],"job_type":"Hourly","budget":0,"duration":"1 to 3 months","workload":"10-30 hrs\/week","job_status":"Open","date_created":"2016-10-29T12:02:21+0000","url":"http:\/\/www.upwork.com\/jobs\/~0130b54f514a9df4f1","client":{"country":"Germany","feedback":5,"reviews_count":1,"jobs_posted":6,"past_hires":6,"payment_verification_status":"VERIFIED"}}