{"id":"~01488740e1d0e12ba4","title":"Accounting clerk needed","snippet":"Job Duties:\n\nPrepares asset, liability, and capital account entries by compiling and analyzing account information.\nDocuments financial transactions by entering account information.\nRecommends financial actions by analyzing accounting options.\nSummarizes current financial status by collecting information; preparing balance sheet, profit and loss statement, and other reports.\nSubstantiates financial transactions by auditing documents.\nMaintains accounting controls by preparing and RECOMMENDING policies and procedures.\nGuides accounting clerical staff by coordinating activities and answering questions.\nReconciles financial discrepancies by collecting and analyzing account information.\nSecures financial INFORMATION by completing data base backups.\nMaintains financial security by following internal controls.\nPrepares payments by verifying documentation, and requesting disbursements.\nAnswers accounting procedure questions by researching and interpreting accounting policy and regulations.\nComplies with federal, state, and local financial legal requirements by studying existing and new legislation, enforcing adherence to requirements, and advising management on needed actions.\nPrepares special financial reports by collecting, analyzing, and summarizing account information and trends.\nMaintains customer confidence and PROTECTS operations by keeping financial information confidential.\nMaintains professional and technical knowledge by attending educational workshops; REVIEWING professional publications; establishing personal networks; participating in professional societies.\nAccomplishes the result by performing the duty.\nContributes to team effort by accomplishing related results as needed. ","category2":"Accounting & Consulting","subcategory2":"Accounting","skills":["accounting","administrative-support","bookkeeping","data-entry","excel-vba","microsoft-excel","microsoft-word"],"job_type":"Hourly","budget":0,"duration":"More than 6 months","workload":"30+ hrs\/week","job_status":"Open","date_created":"2016-10-29T19:46:34+0000","url":"http:\/\/www.upwork.com\/jobs\/~01488740e1d0e12ba4","client":{"country":"United States","feedback":0,"reviews_count":0,"jobs_posted":0,"past_hires":0,"payment_verification_status":"UNKNOWN"}}