{"id":"~014d27f4f84b6b3343","title":"We need freeleancers for an Energy Efficiency Analysis Report","snippet":"Analyse  Energy  Efficiency Report\n\nQ1. Please consider a place familiar to you so you can collect data reliably. This could be your office, home or apartment or room you are living in and perform these steps before starting to write the report.\na) List all the means by which the place you considered uses the energy\nb) Identify all relevant information regarding the products (energy use, alternatives, efficiency, frequency, cost).  \nc) Find out the sources of energy (gas, coal, electricity, solar) and its cost and environmental impact (especially look for carbon emissions per kg or kWh). \nd) What organisations (regulatory and\/or  voluntary) in Australia promote energy efficiency in general and in which way for products you use in the chosen place? \ne) Identify which soft tools (regulatory,  social, financial, marketing)  have worked in reducing the energy consumption or environmental impacts of energy production and delivery in Australia.  Provide at  least one example for each category. \nf ) Identify the opportunities to decrease energy consumption including but not limited to replacement  of devices, timer switches, manual switching off, programmed switches, off-peak power usage, alternative fuel etc.  and select two options for improvement.  \ng) Perform the cost benefit analysis for the two improvement options \nh) Conclude the best option of the two.  \n\nQ2.  Now present  the  information in a report  form individually.  Each sub-question above (1a,  1b..)   can be presented in a subsection with an appropriate sub-title.  The report should have an executive summary, introduction, and background of the place you have chosen. \n\n","category2":"Writing","subcategory2":"Academic Writing & Research","skills":["academic-writing","energy-engineering","report-writing","research"],"job_type":"Fixed","budget":60,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-29T13:49:59+0000","url":"http:\/\/www.upwork.com\/jobs\/~014d27f4f84b6b3343","client":{"country":"Australia","feedback":4.6408275352,"reviews_count":108,"jobs_posted":594,"past_hires":284,"payment_verification_status":"VERIFIED"}}