{"id":"~014c2ca330963ec04b","title":"Content editor to help build mobile catalogues using wix like platform.","snippet":"Getnihao.com allows customers to present Brand and Product information by sales people in store using a mobile app. The content presented varies from customer to customer. Editing of the content is done using our website (similar to WIX for Websites). We are looking for freelancers to help us build new and manage existing customers catalogues using our platform.\n\nThe process of creating a catalogue for brands includes:\n1\/ Extracting relevant content (text, images and videos) from our customers online sites (usually retailers e commerce  websites).\n2\/ Adjusting content to our needs (usually simple word editing, image cropping \/ resizing and fitting into our platform\n3\/ Basic art skills required to edit the look and feel of the mobile catalogue using capabilities provided by the platform.\n4\/ At times some capabilities of HTML and CSS is required to fine tune some of the page views.\n5\/ Scraping the content most often requires basic understanding on how to get that content from the website. \n\nThe lifecycle of the project is an account is simple:\n- Build an initial brand catalogue (i.e. a generic brand template)\n- Adjust to specific customer needs (working with Getnihao.com client rep, tweaking messages, email designs, offers etc...)\n- Provide ongoing support for adjustments e.g. add this product, change this page ... \n\nFor a trained and skilled, creative and relevant freelance we estimate it would take 3-5 days to build an initial mobile catalogue from scratch. We are willing to start with pay \/ hour and then go to pay per catalogue. \n\nWe are a startup just gearing up for growth. This can be a short sprint with us or a life changing opportunity. We currently have 10 brands and aim to have 1000 in the next two years, but it is a startup, who knows.\n\nFor this engagement we are looking to find 1-2 skilled people we can rely on building our next set of brand assets to support our expansion. We will start with two brand catalogues and then, basis the quality and productivity, target another 20 brands.","category2":"Design & Creative","subcategory2":"Other - Design & Creative","skills":["creative-and-talent","css","html","image-editing","online-writing"],"job_type":"Hourly","budget":0,"duration":"More than 6 months","workload":"Less than 10 hrs\/week","job_status":"Open","date_created":"2016-10-29T12:31:59+0000","url":"http:\/\/www.upwork.com\/jobs\/~014c2ca330963ec04b","client":{"country":"Singapore","feedback":0,"reviews_count":0,"jobs_posted":0,"past_hires":0,"payment_verification_status":"UNKNOWN"}}