{"id":"~01578369a19bbea5c5","title":"Automated Bank Postings to Intacct ERP","snippet":"This job is to create an automated or semi-automated integration from online banking to Intacct ERP.\n\nThe current process is to log in to online banking (it is a Jack Henry & Associates system), download the .csv files of each of the accounts, extract specific transactions for which I have defined criteria, format into the Intacct .csv upload specification, and finally log in to Intacct to upload the entries.\n\nThe fully automated solution - I provide credentials for online banking, it automatically downloads all transactions since my last download on each bank account, utilizes my predefined transaction list to extract and format the entries, then I am prompted to provide credentials to Intacct, it automatically posts the journal entries to Intacct.  While I envision Excel being the best tool to perform these actions, you may provide suggestions for alternative solutions.\n\nThe semi-automated solution - I manually login to the bank and download the .csv files.  Then copy\/paste them to a template which utilizes macros to extract the transactions and formats the data in accordance with my predefined transaction list for journal entry.  There is a spot in the template to provide Intacct credentials, which then uploads the journal entries to the Intacct ERP.\n\nThe predefined transaction list MUST be in a user friendly format for future modification.  I will provide the initial list- it will consist of what to look for in transaction descriptions pulled from the bank, the journal code, the general ledger account number, the entity code, the department code, and in certain cases, the text to replace the description.  All other descriptions will be the exact text from the bank.\n\nIN YOUR PROPOSAL, PLEASE IDENTIFY WHICH SOLUTION YOU ARE PROPOSING (FULLY AUTOMATED OR SEMI-AUTOMATED).  Please also identify the method by which you will accomplish each step in the sequence, such as how you will pull bank feeds versus how you will format the journal entries based on the predefined list.\n\nIf you require further clarification please let me know.  Thanks!\nNik","category2":"Web, Mobile & Software Dev","subcategory2":"Scripts & Utilities","skills":["microsoft-excel","php"],"job_type":"Hourly","budget":0,"duration":"Less than 1 week","workload":"10-30 hrs\/week","job_status":"Open","date_created":"2016-10-29T15:41:29+0000","url":"http:\/\/www.upwork.com\/jobs\/~01578369a19bbea5c5","client":{"country":"United States","feedback":5,"reviews_count":3,"jobs_posted":7,"past_hires":7,"payment_verification_status":"VERIFIED"}}