{"id":"~01639541005b0b15f8","title":"Simple Iphone App development for kids with pictures\/sound\/video","snippet":"I am looking for an experience iPhone app developer for creating my app idea.\n\nThe language in which the app has to be created can be any of the iPhone app development languages, objective c or swift.  Important is though, that the app is created in a way so that it can be converted to an android app afterwards without too much hassle.  If this is not easy to do, please inform me why because I have no experience with this so I could be wrong.\n\nMy app idea is to create an app for toddlers and small children.  \nThe app will have 2 modes \"Creation\" and \"Playground\".\n\nIn \"Creation\" mode, a parent, grown-up, can create a playground with pictures and videos.  There will be a possibility to take picture, add sound to picture, create video and remove picture\/video.  The creator can also choose a background for the playground give a name to his creation.  The finished created playground will look like some picture placed on a background and you can scroll up or down on the screen and press on pictures\/videos.\n\nIn \"Playground\" mode, a toddler or small child can press on the pictures\/videos.  When they f.e. press on the picture of \"dad\", the picture will have a small animation (to be discussed later, nothing complicated) and a small sound recording, recorded by dad, will play f.e. \"Hey son, this is your father\".\nWhen the child presses on a video, a small video, recorded by a grown up, will play (maximum length of this video to be defined).\n\nI have made a prototype of my app´s functionality with Invision and will share this with possible candidates after an NDA agreement is signed.\n\nMy app will need the following features:\n-   using the iPhone camera, front or rear, to take pictures, record a video\n-   possibility of editing the picture, only trimming will be necessary at the moment\n-   possibility to rate the app\n-   possibility to give feedback for the user\n-   possibility to share\/recommend the app by mail, facebook, to be discussed, does not     have to be complicated\n-   push notifications (can be enabled\/disabled from within the app) to inform users of updated versions of the app\n-   concerning monetization, I am not totally sure yet which model to use, but at the moment, a free app with ads with the possibility to purchase the app to remove ads seems like the best option.  Alternative options could be - not free, only purchase - or - free with premium contact that can be purchased. I would like to discuss this topic with you, the app developer.\n\nOther topics that I would like to discuss is user interface and graphics.  I am not a graphics person myself but would like my app to look nice.  I will discuss this with you the developer as well.\n\nIf this app turns out to be successful, I would like to use the same developer to make future updates to the app.  My goal is to collect user feedback from the app and use that to make the app better.\nThis job proposition is for the initial app development to the point where it is ready for the app store.\n\nAnd last but not least, during the development of the app, I would like to have access to the app to test it in earlier stages and come with my own feedback.  Possibility to have more than 1 person test the app in earlier stages should be there as well.\n\nAny questions, let me know.\n\nBest regards,\nHans","category2":"Web, Mobile & Software Dev","subcategory2":"Mobile Development","skills":["iphone-app-development"],"job_type":"Fixed","budget":1500,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-28T14:25:25+0000","url":"http:\/\/www.upwork.com\/jobs\/~01639541005b0b15f8","client":{"country":"Austria","feedback":0,"reviews_count":0,"jobs_posted":1,"past_hires":0,"payment_verification_status":"UNKNOWN"}}