{"id":"~0165b7855e35c0cc27","title":"Experienced Marketing Virtual Assistant","snippet":"We need an all round marketing superstar to help us with the implementation of some marketing strategy initiatives. \n\nWe've just set up a website selling luxury silver collectibles and we need your help to start promoting these products and reaching a brand new market. There is pretty much no-one doing what we're doing ight now and we are very confident in the product. We just need to get it in front of the right customers now. \n\nWe're a small, nimble startup and in these early stages we've got LOADS to do. We are looking for motivated self-starters that can hit the ground running and help with many different aspects of marketing  Some of the tasks that we'll be looking for are:\n\n•\tEmail Promotions\/Email Marketing Campaigns \n•\tSetting up email autoresponders\n•\tPress Releases\/Articles\/Newsletters\n•\tConstruction of landing pages\n•\tCreating Facebook contests\/sweepstakes using different apps \n•\tSocial Media Management and Analytics - weekly reports\n•      Link Building\/SEO\n•      Research tasks into competitors\/similar company strategys\n\nWe need someone that has an itimate knowledge of the following apps and platforms:\n•\tShopify\n•\tGetresponse\n•\tFacebook ad manager\n•\tGoogle Analytics\n•\tBuffer\n•\tGleam\n\nNo agencies. please respond to this message quoting '12345jj6' to show that you have read and understood this message. No 'stock\/spam' emails will be replied to.","category2":"Sales & Marketing","subcategory2":"Email & Marketing Automation","skills":["email-marketing","facebook-marketing","google-analytics","seo-backlinking","virtual-assistant"],"job_type":"Hourly","budget":0,"duration":"3 to 6 months","workload":"10-30 hrs\/week","job_status":"Open","date_created":"2016-10-28T06:15:19+0000","url":"http:\/\/www.upwork.com\/jobs\/~0165b7855e35c0cc27","client":{"country":"United States","feedback":5,"reviews_count":12,"jobs_posted":29,"past_hires":26,"payment_verification_status":"VERIFIED"}}