{"id":"~016dda603afe8b4f3b","title":"Complex Image scraping and wordpress uploading jobs","snippet":"We are still looking for more people with expertise in both data scraping and WordPress administration (back end) \/ web design (front end)\n\nWe would like to someone to \n(a) build or customize an existing image scraping program that can efficiently scrape large amounts of images\n\n(b) customize the scraper to upload that data into a wordpress site, and tag\/categorize that data properly. \n\n(c) ensure the gallery plugin can handle this many high resolution images\n\n(d) if the image data would need to be stored locally, familiarity with Dropbox and sharing dropbox folders would be required\n\nEach site and database would only need to be scraped once.\n\nWe have another similar listing, but this one is for mostly image scraping and not as much for text scraping. This is on a project by project basis. If this project goes well, we have about a dozen different scraping and extraction projects you could be doing.\n\nYou should come in with strong experience of how to work with large amounts of data. Also, you should come in with your own suggestions of how to partition and host large image databases (by hosting with a VPS or AWS or something else to that effect). We will need your guidance on that subject. \n\nPlease note that there are several phrases that you need to add to your cover letter even if you were invited to this personally by us in order to be considered.\n\nTO APPLY\n\nPlease add the words \"I love avocados\" to your reply (even if you don't like avocados :) ) so I know that you have read the whole post. Cover letters without all of the required phrases will not be considered.\n\nPlease also demonstrate your understanding of image scraping, wordpress, large databases, and the needs of wordpress websites with large databases (for example talking about cache plugins).\n\nThis is an alternative to our other full time listing. If you are Interested in a full-time scraping position, please check out our profile and apply for that job.","category2":"Web, Mobile & Software Dev","subcategory2":"Scripts & Utilities","skills":["api-development","data-scraping","english","google-adsense","mysql","mysql-programming","python","web-scraping","website-development","website-prototyping","wordpress"],"job_type":"Hourly","budget":0,"duration":"1 to 3 months","workload":"30+ hrs\/week","job_status":"Open","date_created":"2016-10-27T18:53:34+0000","url":"http:\/\/www.upwork.com\/jobs\/~016dda603afe8b4f3b","client":{"country":"United States","feedback":4.9401373722,"reviews_count":389,"jobs_posted":216,"past_hires":590,"payment_verification_status":"VERIFIED"}}