{"id":"~0174c8dfe0e5e4122e","title":"Creative Ghost Writer & Editor","snippet":"We are looking for a creative writer and editor that can transform simple, straight-ahead essays into creative, entertaining stories. \n\nTo apply for this job, you must be able to take core facts and details from an essay and rewrite the essay into a captivating story from beginning to end. The original essays will be completely transformed. The writer should also have the ability to evoke emotions from readers to powerfully convey the content. Above all, the final stories should grab the attention of readers from the first sentence, and each following sentence should result in a desire to read more—all the way to the concluding sentence.\n\nThe writer must have a strong understanding of English spelling and grammar to effectively convey thoughts and details. To apply for this position, you must also be an effective editor and able to finalize the essay, free of all spelling and grammatical mistakes.\n\nEssays will range between 100 and 650 words. The position will start now and conclude in December, with approximately 3 - 5 essays each week. \n\nTo apply for this position, you must submit a creative work sample with before and after versions for comparison. \n\n\nQualifications: \n\n• Expert at creative writing\n• Experience editing for spelling and grammar \n• Reliable\n• Capable of completing each essay quickly and efficiently\n• Able to turn around essays in a few days\n• Must have a strong understanding of English grammar and spelling","category2":"Writing","subcategory2":"Creative Writing","skills":["copy-editing","creative-writing","editing","english-grammar","ghostwriting","proofreading"],"job_type":"Hourly","budget":0,"duration":"1 to 3 months","workload":"10-30 hrs\/week","job_status":"Open","date_created":"2016-10-26T21:31:58+0000","url":"http:\/\/www.upwork.com\/jobs\/~0174c8dfe0e5e4122e","client":{"country":"United States","feedback":5,"reviews_count":2,"jobs_posted":29,"past_hires":27,"payment_verification_status":"VERIFIED"}}