{"id":"~0177394c405a7a6c76","title":"very simple goods tracking app","snippet":"need an iOS app that has the following features:\n \n- profile log in. the profile needs to collect the following information about the user\nbusiness name\nfacility address\nuser name\npicture of user\nuser phone number\nuser email address\nuser's supervisors name\nuser's supervisors email \n\n- save data collected in .xlsx formatted file on phone or attachment in email \n\n- after profile log-in the app would open to a form with 10 fields of entry. The field names are: \ngoods description\nlocation received\nPO#\nweight\nBOL#\nrebate\ncost\ndate received\npayment due date\nother\n\n- whatever is typed into a field would be saved in a drop down menu associated with that field to make it so that you only have to fill in the field manually once and then every time after you would just have to select the answer from the drop down menu. \n\n- each field needs to have an option to insert a picture from file or taken by the phone\n\n- some fields need to be automatically filled in with phone data if available. For example, the location received and date received should not be entered by the user but come from phone data instead \n\n- the bottom of the form needs a save and a submit button. The save button saves the form in .xlsx format to the phone, the submit button automatically opens the phone email app and automatically attaches the file in .xlsx format to the email\n\nThe app name needs to be \"iReceivedIT\"\n\nthat's it. that's literally all the app has to do, just put up a form with a few options. \n\nThanks, \n\n","category2":"Web, Mobile & Software Dev","subcategory2":"Mobile Development","skills":[],"job_type":"Fixed","budget":300,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-28T03:28:57+0000","url":"http:\/\/www.upwork.com\/jobs\/~0177394c405a7a6c76","client":{"country":"United States","feedback":5,"reviews_count":1,"jobs_posted":7,"past_hires":2,"payment_verification_status":"VERIFIED"}}