{"id":"~0177d03bc01ab938c9","title":"Create from scratch an ios game","snippet":"Hello,\n\nI need to create an ios game. \n\nWhat I need:\n\n- Game logic: the rules of the game are simple. It's very similar to fruit ninja. Items randomly appear from right to left in groups. And you are supposed to only grab the ones that are good. I need a points system with bonuses, life counts decrease when you grab something bad, 2 minute timer - more details are in the spec.\n\n- I need integration with game center - best score of the user needs to be displayed.\n\n- Music: background sound, and a couple sounds when something good or bad happens\nI will need to be able to change it with the code you send me.\n\n- I need a special feature. I want to display the user's face in the background. When the user loses. I want to take a picture of him and the character playing, and the ability to share it on facebook\/twitter\/instagram.\n\n- I need a simple tutorial to show the user how to play.\n\nWhat I have:\n\n- I already have the image sets. I also a PSD which you can cut images from.\n- I need you to use any music you have, and I can change it myself later.\n\nI have a full design spec with images, broken down in three parts:\n$50 -> implement my designs and send me the all the frames with the camera enabled (1 day)\n$300 -> implement the game logic with any music you have and my animations (1 week)\n$150 -> implement (the game center, , facebook, twitter, instagram, integration)\n\nFor all three I expect the code to be shared with me, I expect to be able to change the background, animations, and music easily because my designs are not ready.\n","category2":"Web, Mobile & Software Dev","subcategory2":"Game Development","skills":["game-development","game-programming","ios-development","objective-c"],"job_type":"Fixed","budget":500,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-29T14:25:53+0000","url":"http:\/\/www.upwork.com\/jobs\/~0177d03bc01ab938c9","client":{"country":"United States","feedback":5,"reviews_count":3,"jobs_posted":5,"past_hires":3,"payment_verification_status":"VERIFIED"}}