{"id":"~0178b09b7efd0455a5","title":"Roll-up Banner Designs Needed - Need 3 banners, 33.5 inches by 85 inches","snippet":"I am looking for the design of a set of 3 roll-up banners. We would need them within 2-3 weeks. We would want the banners to compliment each other. We have 3 divisions in our company and we would want a specific accent color used to correspond with its division. \n\nThe designs would be largely free of text and convey a feeling of our division, and overall business, with pictures and design. We would want the name of the division at the top (Assessment for example), the some design and\/or photo that conveys our company and division, and have our website and logo at the bottom. \n\n We are an education company. We work with k-12 schools, districts, and states. Our divisions are Assessment (we administer, scan, score, and report on test results), Research and Evaluation (we evaluate data to report on efficacy, use psychometrics to ensure test validity; and collect, clean, sort, compile, and report on data), and Planning (we do enrollment forecasting and boundary planning for districts to help them know how many students they will have year to year and how changing their boundaries will impact this). \n\nOur current thought is that each banner would include a picture of a kid doing something related to each division but that and other design elements are not set in stone. We'd like to see what a professional designer envisions. We work in data, not design. \n\nThe banners will be 33.5 inches by 85 inches (+5 inches mostly unseen at the bottom of the banner). These would need to be of print quality and will be seen from across a room and up close. \n\nWe are looking for a quote on hours, cost, and calendar time to complete these. Thank you for expressing interest and please let me know if you have any questions. ","category2":"Design & Creative","subcategory2":"Graphic Design","skills":["graphic-design","print-design","print-layout-design"],"job_type":"Hourly","budget":0,"duration":"Less than 1 month","workload":"10-30 hrs\/week","job_status":"Open","date_created":"2016-10-28T17:25:11+0000","url":"http:\/\/www.upwork.com\/jobs\/~0178b09b7efd0455a5","client":{"country":"United States","feedback":0,"reviews_count":0,"jobs_posted":1,"past_hires":0,"payment_verification_status":"UNKNOWN"}}