{"id":"~017e57747aca4508e5","title":"Accounting__office admin","snippet":"Job brief\n\nWe are looking for a reliable accounting manager to supervise, monitor and evaluate all day-to-day accounting activities. Accounting manager responsibilities include establishing financial status by developing and implementing systems for collecting, analyzing, verifying and reporting financial information. We are also looking for someone to work closely with our financial management team.\n\nResponsibilities\n\nManage and oversee the daily operations of the accounting department\nProcess month and end year process, accounts payable\/receivable, cash receipts, general ledger, payroll and utilities, treasury, budgeting, cash forecasting, revenue and expenditure variance analysis, capital assets reconciliations, trust account statement reconciliations, check runs, fixed asset activity, debt activity etc\nMonitor and analyse accounting data and produce financial reports or statements\nEstablish and enforce proper accounting methods, policies and principles\nCoordinate and complete annual audits\nProvide recommendations\nImprove systems and procedures and initiate corrective actions\nAssign projects and direct staff to ensure compliance and accuracy\nMeet financial accounting objectives\nEstablish and maintain fiscal files and records to document transactions\nRequirements\n\nProven working experience as Accounting Manager\nAdvanced computer skills on MS Office, accounting software and databases\nAbility to manipulate large amounts of data\nProven knowledge of accounting principles, practices, standards, laws and regulations\nHigh attention to detail and accuracy\nAbility to direct and supervise\nBS degree in Accounting or Finance","category2":"Accounting & Consulting","subcategory2":"Accounting","skills":["accounts-payable-management"],"job_type":"Hourly","budget":0,"duration":"More than 6 months","workload":"10-30 hrs\/week","job_status":"Open","date_created":"2016-10-30T21:26:17+0000","url":"http:\/\/www.upwork.com\/jobs\/~017e57747aca4508e5","client":{"country":"United States","feedback":0,"reviews_count":0,"jobs_posted":0,"past_hires":0,"payment_verification_status":"UNKNOWN"}}