{"id":"~0190dab4858ee9cd61","title":"Web Data research using Company website and other public sources to find information on epoxy resins and protective coatings","snippet":"Please only apply if you have reviewed the excel file and completed the sample of three examples attached in this post! \n\nWe need a serious minded internet researcher to research and collect data on the epoxy resin and protective coatings market. The job is to review websites to find companies and people using Google and contacts using LinkedIn etc. and update an excel spreadsheet. \n\nThe research is to cover industries and applications for epoxy resins such as;\n\n- Architecture\/construction\/ engineering: coatings, adhesives, floors\/walls, carparks, sports floors, warehouse, retail shops, paint, metal, wood, laminating, water and rust sealants.\n- Hobby\/arts\/craft\/ entertainment: adhesive, casting\n- Manufacturing: coatings, adhesive, extrusion, fibreglass, surfboards, marine, furniture, wind turbine blades, automotive \n- Food packaging and storage: coatings, casting, watertanks, BPA free packaging lining \n- Healthcare: Dental \n- Others you may find\n\nResearch is to use web searches to \n1. Identify key multinational and Australian manufacturers and distributors of solvent and water based epoxy resins as well as bio\/renewable\/sustainable epoxy resins used in the above applications\/industries. \n\n2. Specialist Australian contractors, distributors, retailers providing epoxy products in the above applications\/industries including key people and contact details (e-mail, phone, LinkedIN).\n\n3. Major International and Australian trade shows\/conferences for the next 2 years (download\/url exhibitor list) and cross reference exhibitors with 1 and 2 above\n\n4. Australian and International associations and industry groups focused on coatings and composites, green\/sustainable products\/building and green\/sustainable product accreditation's (include url to accreditation information)  \n \n1. You will need to update and expand an excel database including url links to webpages and download product data sheets, MSDS (pdf copies to be provided) and provide urls for Bio\/renewable\/sustainable\/low odour\/VOC epoxy resin products as well as pricing (where available).\n\n2 The excel database and a guide to use it is provided in the first worksheet\n\nThis task requires a hyper focused person with focus on accuracy and qualitative work. The attached file contains the kind of information to be collected. I will provide you with a partially completed list of the companies on a spreadsheet once we finalise details. In the attached example, data has been collected for 1 company. \n\nTo succeed with this task, reading skills, attention to detail and creative problem solving are paramount. \n\nNOTE: If you complete project to our satisfaction within 10 days of being selected we may provide an additional tip of up to $50 in addition to the $250.","category2":"Sales & Marketing","subcategory2":"Market & Customer Research","skills":["business-plans","data-entry","google-searching","internet-research","market-research","microsoft-excel","seo-keyword-research"],"job_type":"Fixed","budget":250,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-28T01:53:13+0000","url":"http:\/\/www.upwork.com\/jobs\/~0190dab4858ee9cd61","client":{"country":"Australia","feedback":0,"reviews_count":0,"jobs_posted":1,"past_hires":0,"payment_verification_status":"VERIFIED"}}