{"id":"~019243b6c4a7467fcd","title":"Native English Speakers Wanted to Write Articles for Travel Niche (Points & Miles)","snippet":"We need a writer who has an interest in points, miles, and travel. \n\nYour daily job is to:\n\n1) Look at the following websites: BoardingArea.com, ThePointsGuy.com, MillionMileSecrets.com, milecards.com, milevalue.com, travelcodex.com, and other relevant points\/miles\/travel sites (there are aggregators available to view all in one place)\n2) Find news topics for the day. Something begin discussed on at least two of these sites within a 24-hour time period would be relevant.\n3) Come up with a list of topics from which we can choose (ideally we would like multiple topics to choose from, where we might want articles for every one)\n4) and deliver an article for our blog\n\nFor example, the hot topics for March 04, 2016 were:\n\n1) 7 bloggers wrote about new Hyatt Brand - the Unbound Collection today as its new hotel brand for pseudo-independent hotels.\n2) 6 bloggers wrote flights between U.S. carries and Cuba that are going to resume this year.\n\nPlease apply only if you're native English speaker. In your application, please include a list of suggested topics from the previously mentioned websites at the moment of your application.\n\nWe pay $20 per article. These articles should take no more than one hour to write. This is  ongoing work, and you will be required to deliver at least one article per day (ideal scenario is 2-3 articles per day)\n\nThere is an opportunity to have additional articles submitted on a daily basis if there are many high-quality topics from which to choose. There is also an opportunity to do additional research to identify additional topics through Flyertalk forums (http:\/\/www.flyertalk.com\/forum\/index.php). This would require subject matter knowledge of what information is relevant\/interesting.\n\nIt is extremely important that pitched topics are delivered within 4-6 hours so that current news events can be editorially reviewed and published.\n\nYour editor will serve as a technical resource if you have questions about points and miles and will be available over Instant Messenger and Skype providing support in real time.","category2":"Writing","subcategory2":"Article & Blog Writing","skills":["article-writing","blog-writing","content-writing","travel-writing","writing"],"job_type":"Fixed","budget":20,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-28T13:27:52+0000","url":"http:\/\/www.upwork.com\/jobs\/~019243b6c4a7467fcd","client":{"country":"United States","feedback":5,"reviews_count":2,"jobs_posted":5,"past_hires":3,"payment_verification_status":"VERIFIED"}}