{"id":"~019db638d2c9dd23a2","title":"Travel Data Specialist - Europe","snippet":"We are looking for motivated travel specialists, with great knowledge of transport and networks within Europe specifically, as well as global in the near future.\n\nCandidates will work independently on researching, collecting and inputting transport information such as bus schedules, train routes and taxi operators.\n\nThis project has varied tasks, ranging from:\n- Finding accurate pricing information for specific routes and taxi fares\n- Inputting various ground transport options within Europe (and wider) into our travel search engine via a custom web based tool\n- Researching for images\n- Maintaining the quality of data\n- Other ad-hoc tasks as they arise\n\nPayment milestones are attributed to amount of routes entered and accuracy will be rewarded with bonuses.\n\nRequirements for successful candidates:\n\n- Perfect English communication skills, candidate should have the ability to ask questions to clarify and give feedback on assigned tasks.\n- Knowledge of Spanish\/Italian or other European languages an advantage\n- Travel experience and knowledge will be regarded favorably\n- Applicants bid title should start with 'Travel Expert' or proposal will not be considered\n- Access to Skype account\n- Access to Google Docs\n- Familiarity with reading commuter timetables\/schedules\n- Ability to use tools such as Google translate\/Wikipedia to problem solve queries\n- Understanding and navigating map technologies such as open street maps and Google maps.\n\n","category2":"Admin Support","subcategory2":"Data Entry","skills":["data-entry","internet-research","italian","spanish","travel-planning","virtual-assistant"],"job_type":"Hourly","budget":0,"duration":"3 to 6 months","workload":"10-30 hrs\/week","job_status":"Open","date_created":"2016-10-30T23:27:10+0000","url":"http:\/\/www.upwork.com\/jobs\/~019db638d2c9dd23a2","client":{"country":"Australia","feedback":5,"reviews_count":4,"jobs_posted":109,"past_hires":117,"payment_verification_status":"VERIFIED"}}