{"id":"~01aaaba26db6c057ad","title":"I need an instruction manual written from PowerPoint slides and videos","snippet":"On advice, I am reposting this job for one module rather than all 18. Once this module has been converted into a manual of sufficient quality the other 17 modules will be placed on this system.\n\nOur company, The Certificate in Finance and Technology Ltd (The CFT) offers a 3-level qualification for people working in technology roles within the financial services sector (e.g. Software Engineers, Project Managers, Business Analysts). We provide all the training for the qualification online through our LMS. The training consists of:\n1. Online videos (there are recordings of PowerPoint presentations being taught and annotated by trainers, the entire screen is the PPT, not trainer is visible)\n2. Downloadable copies of the PPT slides taught in the video\n3. Online questions to test understanding\n4. Downloadable Excel files for certain subjects where appropriate\n5. Text books written by top authors on the subject.\n\nIt is Number 5 we are looking to replace. We want our own textbooks\/manuals for each of the courses rather than relying on published works which do not stick to our syllabus.\n\nWe would like a manual to be written which contains the information in these courses (we call them a Module).\n\nThe Module we are looking for a manual for now is DEBT. This module contains 254 slides and 337 minutes of video on those slides.\n\nWe will provide the successful applicant with access to our Learning Management System as a learner plus copies of the syllabus and all files.\n\nI have uploaded a brief extract of the video for one section, I have moved quickly through the actual video to show the variety.\n\nWe are looking for someone who can take the information and present it in a professional, consistent style manual including contents and full index.\n\nYou can see more about the qualification on our website www.certfintech.org\n\nThanks","category2":"Writing","subcategory2":"Technical Writing","skills":["microsoft-powerpoint","microsoft-word","technical-writing"],"job_type":"Fixed","budget":250,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-28T12:51:49+0000","url":"http:\/\/www.upwork.com\/jobs\/~01aaaba26db6c057ad","client":{"country":"United Kingdom","feedback":0,"reviews_count":0,"jobs_posted":1,"past_hires":0,"payment_verification_status":"UNKNOWN"}}