{"id":"~01a910db4e8ebb804d","title":"Full Stack App Development \/ Front End \/ Back End \/ Design","snippet":"What I need: \nI am open to Android or iOS apps or even a web app (challenge is wifi connectivity at all times in a Y)\n\nWhat is it? \nTour Training App for YMCAs\n\nWhy do they need it? \nMost YMCAs have no idea how to tour properly. Many of them don't even tell you that they are a non-profit and all the good things they do for their community, let alone differentiate themselves from all the competition in an area.\n\nThis app would help YMCAs streamline the training process, so anyone can easily give a mission-driven, quality tour.\n\nNew employee tour training is effective and simple \n•\tEveryone uses the same uniform touring model – no more “just wing it” style tours or “this is what I think is best” type of tours\n\nNo more missed new members because of poor tour quality \n•\tNo more handing out a price sheet at the front desk \n•\tNo more quick, non-engaged, flat tours \n•\tThe business looks much more professional\n\nSignificantly increase closing ratios \n•\tConvert guests to members\n\nCollect valuable tour data \n•\tValuable closing ratio data to learn which staff members give the best tours \n•\tSurvey data on how you can improve your Y \n•\tData on why members choose not to join\n\nFollow up with members \/ surveys \n•\tFuture marketing efforts \/ e-blasts\n\nThis is a system that works and has been proven in over 120 Ys across the country. THE BEST PART: Low cost – high ROI. 1 additional membership A MONTH and it MORE THAN PAYS FOR ITSELF!\n\nWhy are we qualified to offer it? \nIn the last 7 years, I have personally worked with over 120 YMCA's, generated 18-million in new membership revenue through our performance-based membership development services. I want to take our 20 years of touring and membership sales experience and transform it into an app that is very simple and user-friendly. It will guide YMCA employees through a proper tour, prompt them to ask certain questions, and require them to give out important information about their Y.\n\nOur company sells 6-8 new memberships a day when we use these tour techniques in a YMCA. If a Y using our app sells just 1 new membership a month, it pays for itself.\n\nThe market \nIn the U.S., the Y is comprised of YMCA of the USA, a national resource office, and more than 2,700 YMCAs with approximately 19,000 full time staff and 600,000 volunteers in 10,000 communities across the country.\n\nIndividual YMCAs are the initial target. The cost will be $649.00 upfront (hardware cost, tablets, front desk mounts, etc) and $129.00 per month access to the touring \/ training app. I am very confident I can QUICKLY get it into every one of the 120 Ys I have personally worked with, and then into at least half of the 2,700 Ys across the country. \n\nOther markets: \n•\tPrivately owned health clubs \n•\tHospitals wellness centers \n•\tLow-end Franchise Fitness Clubs (Snap, Anytime Fitness, Workout Anytime, etc) \n•\tHigh-end Franchise Fitness Clubs (Golds, LA Fitness, 24 Hour Fitness, etc)\n\nWhat I need \nThis is a very simple app for a seasoned developer to create. I need someone who can make this very professional-looking and user-friendly. This needs to look like a 2-million dollar app.\n\nThe backend sales metrics, graphs and analytics I want for this app are VERY important, as is the ongoing marketing and follow-up system. I have 37 pages of detailed notes on exactly what I need.\n\nI need: \n•\tSomeone that has EXPERIENCE \n•\tSomeone as passionate and motivated as I am about this opportunity \n•\tSomeone who can get this done very fast, but not sloppily \n•\tA seasoned PROFESSIONAL \n•\tA business partner that has some business sense \n•\tSomeone that can continue to build the app and keep improving it \n•\tExcellent communication – I want someone that is available by phone and\/or email any time of the day\n\nWhat I don't want: \n•\tSomeone that has no experience \n•\tSomeone that is going to \"figure it out as they go along\" \n•\tSomeone that has low motivation \n•\tSomeone that is slow at producing results \n•\tSomeone with no vision \n•\tSomeone that has poor communication skills\n\nMy goal is to start BETA testing this in Jan. 2017 at the very latest.","category2":"Web, Mobile & Software Dev","subcategory2":"Mobile Development","skills":["android","android-app-development","ios-development","ipad-app-development","iphone-app-development","mobile-app-development"],"job_type":"Fixed","budget":10000,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-28T22:56:57+0000","url":"http:\/\/www.upwork.com\/jobs\/~01a910db4e8ebb804d","client":{"country":"United States","feedback":4.8285231497,"reviews_count":9,"jobs_posted":18,"past_hires":14,"payment_verification_status":"VERIFIED"}}