{"id":"~01accff1de76a03a92","title":"PHP Development of Payment Process API","snippet":"We are looking for a talented developer who can write packages for PHP 5.4, to implement the API of a payment service provider.\n \nThe documentation for the payment service provider can be found at:\n\nhttps:\/\/dlocal.com\/documentation.php?sec=full-api\n\nWe expect this project to be delivered in two parts:\n\nPart 1\n\nWe expect a functional specification of the software you are going to implement, as well as documentation on the classes and how we would use them.\n\nWe would then review this and send any feedback back to you.\n\nOnce the spec and documentation are approved, we would move on to Part 2.\n\nPart 2\n\nWe would expect to be delivered a collection of classes that can be dropped in to any application and can be used through a sensible interface to take and make payments from the payment gateway.\n\nIdeally, these would be supported by Unit Tests and would be able to be dropped in to existing software, where the integration method would be something like (class names for example purposes only)\n\n$sale = new Sale();\n$sale->createInvoice( 'Order ID: 1234');\n$sale->totalAmount = 400.25;\n$sale->cardDetails ( \"16 Digits\", \"CVV\", \"Expiry Date\" );\n$sale->processOrder();\n\nThe major prerequisites are:\n\n1) The package is compatible with PHP 5.4\n2) The package code is documented, and any additional PHP dependencies are kept to a minimum \n3) The package can be easily used from various sources, including being included via composer.\n4) The package should, where possible, be supported by Unit Tests.","category2":"Web, Mobile & Software Dev","subcategory2":"Ecommerce Development","skills":["html","json","php"],"job_type":"Fixed","budget":100,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-28T08:49:33+0000","url":"http:\/\/www.upwork.com\/jobs\/~01accff1de76a03a92","client":{"country":"United Kingdom","feedback":4.9457834313,"reviews_count":25,"jobs_posted":368,"past_hires":225,"payment_verification_status":"VERIFIED"}}