{"id":"~01a1fbb4a9d8a6c191","title":"Seeking a motivated, driven, and passionate real estate virtual assistant","snippet":"Real Estate Investment Assistant\/ Intern \n*This is salary-based position and depends on experience and capabilities. *A college degree is desired but not required. We need are looking for a go getter, who will work with passion, vision, and desire if you are not motivated don’t waste our time or yours\nWe are looking for someone who has: \n--A positive attitude  \n--A good work ethic   \n--Thinks on their feet \n--Punctual-- \"if your not early, then you're late\" \n--Organized \n--Effective time management skills \n--Never have to be told twice to do the same thing \n--Multitask and prioritize \n --Good phone skills \n--Good computer skills\n- must be efficient in Microsoft Office \nJob duties have the potential to change but below are a few tasks that the new position will be responsible for: \n--Manage acquisitions in specific Areas  \n--Spend lots of time communicating with potential sellers to buy there homes \n--Find Realtors, Title Companies, and other \"A\" Team players to work with in various areas \n--Go through MLS listings and submit offers on promising properties\n--Make outbound calls to potential sellers and communicate the value we will bring seller\n--Receive inbound calls and collect data on property from customer\n-- Make outbound calls to potential buyers to learn and document their buying criteria\n-- Go through database and match properties available with interested buyers  \n--Track offers submitted and counter offer as needed \n--Gather and track information on accepted offers  \n--Ensure the process runs smoothly and the property closes on time \n--Send Earnest Money and ensure its reimbursement \n--Handle shipment of notarized and overnighted documents \n--Communicate with the team on assignments and purchases \n--Call and work with multiple banks in various areas \n--Some telemarketing to discover new areas to invest (not sales) \n--Manage my database of properties\/work with property managers on monthly profit and loss reports \n--Create and manage various accounts \n--Build postlets and other forms of advertisements on properties \n--Normal admin duties such as printing\/scanning\/overnighting documents --Other tasks as needed  \nOur companies are growing fast and we are expanding.  This will be a fast paced position and requires someone with a strong sense of direction that can think on his or her feet.  I am a good trainer; I'm looking for a fast learner.  You must have the ability to over come obstacles and work through challenges.\n","category2":"Sales & Marketing","subcategory2":"Telemarketing & Telesales","skills":[],"job_type":"Hourly","budget":0,"duration":"More than 6 months","workload":"30+ hrs\/week","job_status":"Open","date_created":"2016-10-30T07:47:37+0000","url":"http:\/\/www.upwork.com\/jobs\/~01a1fbb4a9d8a6c191","client":{"country":"United States","feedback":0,"reviews_count":0,"jobs_posted":1,"past_hires":0,"payment_verification_status":"UNKNOWN"}}