{"id":"~01ba15210214022b32","title":"Seeking Experienced Development Company for Commercial Software Appliation","snippet":"About Us\n\nHoot Interactive is a small digital advertising firm that is now entering the commercial software business.  We have developed a set of tools that automate processes associated with managing search advertising campaigns on the Google AdWords network.  Our customers are other digital advertising agencies that provide services to primarily auto dealerships.  \n\n\nAbout Our Software\n\nOur software is currently named the “Inventory Monitor” due to its original purpose of integrating vehicle inventory levels with AdWords campaigns.  e.g. When a Toyota Tundra is in inventory, associated ads are activated.  When not in inventory, associated ads are paused.  Instead of accomplishing this integration by connecting with an inventory data feed, we crawl every URL of every ad to determine if it lands on a page with a successful list of vehicles or a “no results found” page.  The landing page experience then determines the status of the ad.  \n\nA slightly more detailed description of our software can be found at http:\/\/www.hootinteractive.com\/sem-software\/.  \n\n\nWhat We’re Looking For\n\nWe are seeking a long-term partnership with a reputable, experienced software development company to accelerate our dev schedules.  We would like this future partner to meet the following criteria. . . \n\n•\tOver 5 years’ experience as a company building data-driven commercial software applications. \n•\tExperience building web scraping tools. \n•\tExperience setting up Google API connections, preferably experience with the AdWords API.  \n•\tSkilled in MySQL, PHP, Javascript, and GitHub. \n•\tCan offer recommendations and solutions for system scalability and performance.  \n•\tAbility to support the software for a retainer on a long-term basis.  \n•\tPrimary point of contact must be fluent in English.\n\nWe are budgeted for and would like to purchase 10-15 hours per week of development work on an ongoing basis.  First project will be to design a more scalable, multi-threaded version of our page scraping component.  Based on our experience working with your company during this initial project, we will be able to commit to a longer-term engagement.  ","category2":"Web, Mobile & Software Dev","subcategory2":"Other - Software Development","skills":["api-development","github","google-adwords-api","google-analytics-api","javascript","mysql-programming","php","web-scraping"],"job_type":"Hourly","budget":0,"duration":"More than 6 months","workload":"10-30 hrs\/week","job_status":"Open","date_created":"2016-10-28T18:24:28+0000","url":"http:\/\/www.upwork.com\/jobs\/~01ba15210214022b32","client":{"country":"United States","feedback":5,"reviews_count":2,"jobs_posted":5,"past_hires":3,"payment_verification_status":"VERIFIED"}}