{"id":"~01b558905127ba770e","title":"Server based Tool for Estate Agents","snippet":"The task at hand ist to develop a server based tool for estate agents with as I see it a rather complex functionality. Besides developing the tool I also require apps. Once the tool is developed and working I need continuous support to add further functionality and to improve the tool.\r\nPlease find below a brief version of what should be accomplished. I don’t want to reveal the detailed functionality here in public. Please contact me if you are interested in the project and I will send you a longer description.\r\nPlease find below an overview on the tool I have in mind:\r\n1)\tThe main purpose of the tool is to transfer the workflow of an estate agent into a software tool to make the various tasks of estate agents more easy and to increase the efficiency of their work. \r\n2)\tTo avoid having to put in the same information several times a database should be provided which allows for an easy transfer of information. In other words: The data of all modules must be interconnected. For example:  If an appointment is put in it not only appears in the calendar but also in the dataset of the concerned client as well as the object. Or another example: If a client is interested in a particular object this information has to be located in both the module “Clients” as well as “Objects”. Therefor it can be seen which clients were interested in which object while at the same time it is possible to have an overview on anything related to the client. Etc.\r\n3)\tIt is of utmost importance that the tool is very easy to use. The workflow and the different steps in the work process should be shown in a kind of graphical overview to make it easy for the user to recognize where he is within the workflow.\r\n4)\tThe tool must be set up in a modular way. It is very important that additional functionality can be added to each module. It should also be possible to integrate additional modules.\r\n5)\tThe tool should be accessed via browser as well as Android and Apple app.\r\n6)\tThe tool should contain nine modules:\r\na.\tClients\r\nb.\tObjects (=flats, houses, etc.)\r\nc.\tCooperation partners\r\nd.\tTasks and appointments\r\ne.\tEmail\r\nf.\tSocial platforms\r\ng.\tStatistics\r\nh.\tAdministration\r\ni.\tProductivity\r\n7)\tThe tool should allow the user to put in a variety of data for each of these modules. To be more precise:\r\na.\tClients: Address, information on the type and the possible location of object the client is looking for\r\nb.\tObjects: Address and various other information relevant to an object like a flat or house. \r\nc.\tCooperation partners: Address and additional information.\r\nd.\tTasks and appointments: Data on tasks as well as transferring these into a calender.\r\ne.\tEmail: The tool should have an incorporated email functionality allowing users to send and receive messages.\r\nf.\tSocial platforms: The tool should provide a functionality like Buffer allowing users to publish on social platforms from within the tool.\r\ng.\tStatistics: Various data should be collected and processed. It should be possible to create graphic overviews on these.\r\nh.\tAdministration: An admin area for the user as well as for me in which user rights can be defined and other settings be made.\r\ni.\tProductivity: Here data on work hours, money spent on projects, etc. are collected and processed.\r\n\r\nI am looking for a contractor, preferably a company, which not only develops this software but also continually works on it to remove discovered errors and extend the functionality. As I am therefore dependent in a long-term perspective on the collaborator I am forced to be very selective in my choice.\r\nI would appreciate if you could state your previous experience with this kind of project and if possible could also give me the contact data of some present or former customers so that I can talk to these.\r\n\r\nThat’s all at this point. Plese send me a message for a more detailed description. After having looked through this longer description we can talk about how to proceed.\r\nPlease note that I have just put in some random number under costs.\r\n\r\nMany thanks for your interest,\r\nJosef\r\n\r\n\r\n","category2":"Web, Mobile & Software Dev","subcategory2":"Other - Software Development","skills":[],"job_type":"Fixed","budget":1000,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-28T12:29:19+0000","url":"http:\/\/www.upwork.com\/jobs\/~01b558905127ba770e","client":{"country":"Germany","feedback":4.5991565848,"reviews_count":84,"jobs_posted":186,"past_hires":143,"payment_verification_status":"VERIFIED"}}