{"id":"~01be552938a8c9f37c","title":"Creative Logo Design Needed for Private Photo, Audio, Video & Text Journal","snippet":"I am looking for a unique and decent logo for domain dlyfetime.com\n\nLogo characters: DLyfeTime\n\nPurpose of domain: \nDLyfeTime is a private social media platform cum personal diary space & Cloud storage.\nIt aims to be your online private journal where you can digitally record, save and collect your thoughts, preserve memories or moments in the form of photos and videos, share them with few people if you want, create dream lists \/ wishlists to keep a track of your dreams and aspirations, and even push you to achieve those goals and wishes in the form of reminders.\nThis domain is created with an intention of giving social networking “a different angle”, so as to allow its users their own private space, free of any unnecessary and unwanted interruptions.\n\nDLyfeTime is a personal diary for those of you who want a social network minus the socializing and the networking. Sharing the posts is an option, but you get to choose who with.\nTake a picture, caption it and post it in on the Canvas Wall and you can choose to share this image with a selected few people. Same goes with videos. The app gives you enough privacy and space while still keeping in theme with being a social media platform.\n\n\nAny Two Color Combination is Allowed. In which one color should be\n#fec341 - Yellow\n\nSecond Color may be from below or select on your own.\n#2ab300 - Green\n#424242 - Black\n\nLogo should be in PNG and can work with any background Black or White.\n\n\n\n\n\n\n\n","category2":"Design & Creative","subcategory2":"Logo Design & Branding","skills":["creative-and-talent","logo-design"],"job_type":"Fixed","budget":100,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-27T19:32:59+0000","url":"http:\/\/www.upwork.com\/jobs\/~01be552938a8c9f37c","client":{"country":"India","feedback":5,"reviews_count":2,"jobs_posted":3,"past_hires":2,"payment_verification_status":"VERIFIED"}}