{"id":"~01cf24e3fb37721d56","title":"Lead Generation Specialist","snippet":"I am hiring a Lead Generation Specialist to find contact and other general information about companies I am looking to contact.\n\nSpecifically, you will be finding:\n-Personal contact information for individuals within an organization\n-Company name, address, website, and other information depending on the task\n-The contact information is typically NOT available on the company website, so please keep this in mind as you apply. You will need to find the contact information on Jigsaw, Manta,  etc.\n\nI will only consider freelancers with experience in using LinkedIn (Premium), Jigsaw, Manta, Hoover's or other business directories with personal email addresses of business executives.\n\nPlease use the word \"Banana\" when applying for this position and indicate the list of business directories you have experience in using at the top of your application.\n\nIt is extremely important that you are able to quickly find personal email addresses for individuals high up within an organization. I have had to let several contractors go because they weren't able to do so. If you are unable to efficiently find contact information from these sites, you won't be hired.\n\nI hope to hire someone and keep them on long term - this job will start at part-time but if you are the right candidate after working together for a few months, there would be opportunity to transition to full-time (40 hours a week) if you'd like.\n\nI will ask you to complete a 10 hour project initially to make sure you will be able to successfully complete the job. Please feel free to contact me with any questions. I look forward to your application.\n\nIMPORTANT: We do not allow manual hours to be entered as a policy given the remote nature of this work. All work must be logged through the Upwork website so that it can be audited if necessary.","category2":"Data Science & Analytics","subcategory2":"Data Mining & Management","skills":["data-mining","data-scraping","google-docs","internet-research","lead-generation","virtual-assistant"],"job_type":"Hourly","budget":0,"duration":"3 to 6 months","workload":"30+ hrs\/week","job_status":"Open","date_created":"2016-10-27T21:28:58+0000","url":"http:\/\/www.upwork.com\/jobs\/~01cf24e3fb37721d56","client":{"country":"United States","feedback":4.8454052374,"reviews_count":10,"jobs_posted":26,"past_hires":26,"payment_verification_status":"VERIFIED"}}