{"id":"~01cbdfe27be698b9a6","title":"Taxi App (like Uber) for a specific geography","snippet":"I need someone to help me work on creating an iOS taxi like app (think Uber!) for a specific geography. We are two EDM loving young investor-backed entrepreneurs in Greece with experience in the sector and the App will primarily be used in the tourist industry.\n\nWe will need it to have a 1) customer facing aspect and a 2) driver facing aspect. Moreover, we will need data collection and databases to be presented on a 3) dashboard for our business. We will require both backend and front end coding solutions. We would like it to be coded in Swift. All code will belong to us.\n\nThis app will use:  \ncard.io and Braintree for payments processing\nMapkit & Google Maps API for routing and maps + GSMGeocoder\nCore Location for getting Customer location\nApple Push Notifications for notifications\n\nWe will need someone who can:\nCreate the final wireframe\nCreate a fully functioning booking system \nCreate a fully interactive Customer, Driving and Dashboard system\nCreate a basic AI which assigns bookings to the nearest free driver\nCreate an automated database for bookings, transactions, customer info and other criterion\n\nMust be available to provide support during pre and post launch.\n\nPlease let us know if there are any questions or clarifications needed. \n\nAll prospective developers are requested to include a bio on themselves, a portfolio, proposed technical solution, provisional timeline and pricing structure (we expect it to be tied to agreed milestones). Moreover, tell us a bit about yourselves as we are looking for someone\/a team which will have a long term relationship. We are open to various solutions.\n\nWe look forward to hearing from you!\n","category2":"Web, Mobile & Software Dev","subcategory2":"Mobile Development","skills":["ios-development","iphone-app-development","javascript","mobile-app-development","swift","ui-design"],"job_type":"Fixed","budget":10000,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-28T00:33:30+0000","url":"http:\/\/www.upwork.com\/jobs\/~01cbdfe27be698b9a6","client":{"country":"Greece","feedback":0,"reviews_count":0,"jobs_posted":0,"past_hires":0,"payment_verification_status":"UNKNOWN"}}