{"id":"~01c964ea04a3572c33","title":"Data Cleaning and enhancement of ship-to addresses to enable analysis and direct marketing","snippet":"My company is a manufacturer that sells through distributors.  I want to clean and analyze our ship-to address data to better understand our end users and enable direct marketing to them.    I have a several spreadsheet databases containing 5000+ rows of data.      With this data I need the following done:\n1. Real company name\/parent company extracted.  I have lines of data with the same company listed with different names.  For example ABC Mfg Co, ABC Manf Co, is really ABC Manufacturing Company.   \n2. Extraction of phone number from a field containing both physical address data and phone number. \n3. Addition of NAIC code or some way to code parent company by industry classification.  I developed a rudimentary method of googling each parent company name and making and educated guess, but this is highly inefficient.  I assume there's a database service we could use if we provided parent company name and zip code.   \n4.  Addition of email addresses.  We don't have email addresses for the receivers of our products, but again we developed a rudimentary way to get them by googling the company and\/or using linked in.  There is probably a faster way. especially for large company repeat customers.  \n\nIn the attached file, my database has rows A-N.  I added columns O, P, Q, R manually.   I would love to have Column S.   Column O is a generic industry classification I created, NAICs code would be better.   ","category2":"Data Science & Analytics","subcategory2":"Data Mining & Management","skills":[],"job_type":"Hourly","budget":0,"duration":"Less than 1 week","workload":"10-30 hrs\/week","job_status":"Open","date_created":"2016-10-29T15:48:34+0000","url":"http:\/\/www.upwork.com\/jobs\/~01c964ea04a3572c33","client":{"country":"United States","feedback":5,"reviews_count":1,"jobs_posted":2,"past_hires":2,"payment_verification_status":"VERIFIED"}}