{"id":"~01c2b0fd1f5675e02a","title":"I need to standardize, tokenize, and then deliver a logstash config, output, and rspec file from a Palo Alto network device.","snippet":"*Due Date is Monday, Oct. 31 at midnight EST\/0400 UTC*\n\nOverview:\n\nFirst, a set of raw logs need to be tokenized and standardized. During this step, the raw logs are converted into a JSON representation using a common set of key names.\n\nTokenization and standardization:\n\nThe goal of this task is to do the tokenization and standardization of a log source. The log in question is from a Palo Alto Networks device. For documentation about the logs themselves, visit\nhttps:\/\/www.paloaltonetworks.com\/documentation\/71\/pan-os\/pan-os\/monitoring\/syslog-field-descriptions\n\nThe tokenization and standardization are to be done in Logstash:\nhttps:\/\/www.elastic.co\/products\/logstash\n\nQuestions to answer about the incoming log sources are:\n- What format are the source data in? Does logstash natively support this format?\n- How many different types of messages are there?\n- Are all of the messages useful \/ informative?\n- What are the interesting attributes that we want to extract from the logs?\n- Are there existing attribute names that we could leverage?\n- Is there any other transformation that needs to be done at this stage?\n\nThe example logstash configuration should read the input data from a file and write the output to a separate file.\n\nThe output log lines should be JSON formatted.\n\nIn addition to the mapping itself, the graph mapping should also contain an rspec file. An rspec file is essentially a unit test that verifies that a raw log is correctly tokenized.\n\nAdditional details in the attached file. Data file will be shared once the project is ready to start.\n","category2":"Web, Mobile & Software Dev","subcategory2":"Other - Software Development","skills":[],"job_type":"Fixed","budget":75,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-28T04:57:28+0000","url":"http:\/\/www.upwork.com\/jobs\/~01c2b0fd1f5675e02a","client":{"country":"United States","feedback":0,"reviews_count":0,"jobs_posted":0,"past_hires":0,"payment_verification_status":"UNKNOWN"}}