{"id":"~01c45cc97c2b8c0c3c","title":"SEO\/SEM Expert","snippet":"We are looking for an SEO\/SEM expert to manage all search engine optimization and marketing activities.\nYou will be responsible for managing all SEO activities such as content strategy, link building and keyword strategy to increase rankings on all major search networks. You will also manage all SEM campaigns on Google, Yahoo and Bing in order to maximize ROI.\nResponsibilities\n• Execute tests, collect and analyze data, identify trends and insights in order to achieve maximum ROI in paid search campaigns\n• Track, report, and analyze website analytics and PPC initiatives and campaigns\n• Manage campaign expenses, staying on budget, estimating monthly costs and reconciling discrepancies.\n• Optimize copy and landing pages for search engine marketing\n• Perform ongoing keyword discovery, expansion and optimization\n• Research and implement search engine optimization recommendations\n• Research and analyze competitor advertising links\n• Develop and implement link building strategy\n• Work with the development team to ensure SEO best practices are properly implemented on newly developed code\n• Work with editorial and marketing teams to drive SEO in content creation and content programming\n• Recommend changes to website architecture, content, linking and other factors to improve SEO positions for target keywords.\nRequirements\n• Proven SEO experience\n• Proven SEM experience managing PPC campaigns across Google, Yahoo and Bing.\n• Solid understanding of performance marketing, conversion, and online customer acquisition\n• In-depth experience with website analytics tools (e.g, Google Analytics, NetInsight, Omniture, WebTrends)","category2":"Sales & Marketing","subcategory2":"SEO - Search Engine Optimization","skills":[],"job_type":"Hourly","budget":0,"duration":"More than 6 months","workload":"Less than 10 hrs\/week","job_status":"Open","date_created":"2016-10-27T19:31:30+0000","url":"http:\/\/www.upwork.com\/jobs\/~01c45cc97c2b8c0c3c","client":{"country":"United States","feedback":0,"reviews_count":0,"jobs_posted":1,"past_hires":0,"payment_verification_status":"UNKNOWN"}}