{"id":"~01d16d526889db08ad","title":"Software review from strong SQL analysts with expertise with BI software.","snippet":"**Introduction**\n\nOur cloud BI software makes it extremely easy and flexible for data analysts to create and share reports through making SQL better for data reporting. \n\nWe see SQL as a direct, flexible and more efficient way to extract data for reporting and we've built our tool for SQL analysts (not business users) to make their work easier, less repetitive and less frustrating.\n\n**Goal:**\n\nWe like to understand more use-cases where SQL is more suitable to create reports we like to compare ourselves with existing business intelligence data reporting or visualization tools. Exclude pure ETL and data warehouse players unless they have a reporting module bundled in too.\n\n\n**What we want: Report Examples and Write-ups**\n\nWe are looking for 3 key inputs to comparing between a BI tool (either commercial or open source) and our software.\n\n1. Around 3-5 Report Examples  (let us know if you have more examples) where you find it difficult (if not impossible) to create reports with your BI tool without using SQL. Include for each report example:\n    A. Short description overview of the scenario you want to achieve\n    B. Visual mock-ups of the report you have in mind (with filters, data tables and charts)\n    C. The database table\/schema that contains your source data with some sample records (We are looking for scenarios, so do not send us actual real data from your company. You can just let us know the field type names and data types, and some sample masked data records)\n    D. The process you will create the report with the BI tool you are familiar with (step-by-step with screenshots) with an estimated time it takes you.\n    E. How you will create the report with our SQL based reporting tool, or through plain SQL statement (no worries we can help with our own report-creation)\n\n2. Write-up to describe situations where\n    A. You will recommend a tool like ours compared to your BI tool. \n    B. You will not recommend a tool like ours compared to your BI tool.\n\n3. Writeup on strength\/weakness analysis between your existing BI tool and our software (outside of the examples you've listed). Which target market segment (industries, target market and teams) that you find our tool suitable for.\n\nNote: We don't expect good grammar perfect English here as long as we can understand what you mean. Just list or describe to us the best you can. So don't be discouraged if you are not so much a writer.\n\n\n**Who we are looking for:**\n\nYou don't need to have all these attributes, but the more you have - The more interesting you are for us.\n\n* Strong SQL skill-sets and prior working experience as a data analyst, engineer or scientist\n* Candidates who can easily distinguish reporting use-cases where it's simpler\/clearer to extract data through SQL queries (on a one-off effort basis) as compared to creating the same report through a drag\/drop visualization solution.\n* Experience with creating reports from a database with a commercial or open source BI tool\n* Experience with evaluating the purchase or use of a BI tool (bonus) for a company\n\n**What we can provide to applicants **\n\nWe can answer any questions you have, or provide more context of what we do if you need more information to prepare your proposal such as:\n\n* 2.5 min overview video on how our solution works\n* User Docs on how our software works\n* Sample Customer Case Study (optional)\n\nIf we find your profile interesting, we will also provide you examples of what we do not want (motherhood industry jargons and terms, tabular feature comparison etc) so you have a better assessment on whether this makes sense for you to work on.\n\n**To apply, let us know**\n\n* The BI tool(s) that you will compare us to, and how well you know your software\n* Your Linkedin Profile\/Resume, and why you think you are suitable for this role.\n* An indication of how many report examples you have in mind based on  the scope above (feel free to clarify with us to clarify some information you need)\n* An indicative budget for this engagement. You can assume that you are comparing against vanilla SQL queries (by giving us the syntax for a specific filtered criteria if that helps in your use-cases).\n* A frustrating experience you had while working in the data space (ie from data requester, from the gap in your BI tool, data preparation process, or company process\/flow). This helps us better understand the problem\n","category2":"Data Science & Analytics","subcategory2":"Data Visualization","skills":["business-intelligence","crystal-reports","data-analysis","microsoft-sql-ssrs","qliktech-qlikview","sql","tableau"],"job_type":"Hourly","budget":0,"duration":"Less than 1 week","workload":"10-30 hrs\/week","job_status":"Open","date_created":"2016-10-29T14:45:16+0000","url":"http:\/\/www.upwork.com\/jobs\/~01d16d526889db08ad","client":{"country":"Singapore","feedback":0,"reviews_count":0,"jobs_posted":1,"past_hires":1,"payment_verification_status":"VERIFIED"}}