{"id":"~01d0f4192b5b7f3051","title":"Automating Account Creation for new website, subdomain","snippet":"Need to write script to automate functions related to the creation of a web site account for new users. \n\n- Accept user input and verification code\n- Use this input to do the following\n - confirm verification code and proceed if a match\n - create directory\/subdirectory structure and copy files to this new directory\n - create a subdomain pointing to this directory\n - create a new MySqlDatabase and credentials\n - edit a \"config\" file to store these credentials\n - populate this database accordingly\n - schedule a cronjob for a specified script, using client input to differentiate it\n\n\nWalkthrough: \nCustomer Bob signs up, is given the link to the script and a verification code via other automation unrelated to this script. \n\nUpon accessing this script, Bob is prompted for information (name, contact information, businesss name, desired subdomain (also used for folder, etc)) including verification code. Provided the verification code is valid, the page will then initiate the following: \n\n- Accepting input from Bob, the script will generate a folder using a slug or url-friendly name (bobs-stuff)\n- The script will copy files from a specified, generic, location to \"bobs-stuff\"\n- The script will generate a subdomain, bobs-stuff.mydomain.com, pointed toward the folder bobs-stuff\n- The script will generate a mysql database and appropriate credentials\n- The script will edit configuration files copied over to include the generated credentials\n- The script will run a mysql db file, installing a series of tables and entries to the newly created mysql database\n- The scriipt will schedule a cronjob call to a specified script located in the copied files under \"bobs-stuff\"\n\nWill also need simple but attractive, professional, interface for the forward-facing elements of data collection and status updates.\n\nIDEALLY this will be made relatively generic with the ability for me to include new files, update files, as time goes on and the scope expands. \nAn addition may be called on down the line to collect some additional data, process an image for primary colors, and update a CSS sheet with partuclar variables as a means of instantly setting a template for the client on their new site. \nThe host is InMotion Hosting, using a VPS with cPanel, so we have access to the cpanel API for generating some of these elements. \n\nHost details as follows: \ncPanel Version \t58.0 (build 32)\nApache Version \t2.4.18\nPHP Version \t5.5.35\nMySQL Version \t5.6.33\nArchitecture \tx86_64\nOperating System \tlinux\nPerl Version \t5.10.1\nKernel Version \t2.6.32-042stab113.11\ncPanel Pro \t1.0 (RC1)  \n\nBudget negociable based on credentials, turnaround history. Prefer to keep overall scope small, final product flexible. ","category2":"Web, Mobile & Software Dev","subcategory2":"Web Development","skills":["css","html","javascript","jquery","mysql","php","web-design","website-development"],"job_type":"Fixed","budget":100,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-29T21:22:50+0000","url":"http:\/\/www.upwork.com\/jobs\/~01d0f4192b5b7f3051","client":{"country":"United States","feedback":0,"reviews_count":0,"jobs_posted":0,"past_hires":0,"payment_verification_status":"UNKNOWN"}}