{"id":"~01e66d5f7e8aa751c8","title":"I need an SEO professional who specializes on onpage SEO and has experience working in the UK market","snippet":"I am the webmaster of Wikigains.com, which is a new exciting coupon website targeting the UK market.\nMy company need an experienced SEO professional, who specializes on onpage SEO, to help us and advise us on the following:\n1. Audit link structure, meta tags, etc.\n2. Identify problems on our Google WMT and provide recommendations for solutions.\n3. Prepare a new Sitemap using a third party tool that can reliably crawl the entire site and submit to Google.\nApart of auditing our website, preparing the report and recommendations and seeing us through the implementation, I would really appreciate it if you spent time with me on the phone\/skype after your audit to explain to me what you found and the reason behind your recommendations. I am looking for the person who is willing to teach me a few things along the way about on-page SEO of our own website and our Google WMT.\nThe right person will be given access to our Google WMT, therefore, for practical reasons the candidate we will choose will be based in the UK, understands the UK market and has at least 4 years experience in SEO either within a UK agency or as a freelancer working with UK websites. However, we cannot discriminate on the basis of location or ethnicity, so if you feel you meet the criteria feel free to apply.\nWe would need this person to start immediately and have 1,2 and 3 done by 12 November 2016.\nTo select the person, I may need to do short telephone interviews. No cover letter is required. I look forward to your response.","category2":"Sales & Marketing","subcategory2":"SEO - Search Engine Optimization","skills":["on-page-optimization","seo","seo-audit"],"job_type":"Hourly","budget":0,"duration":"Less than 1 month","workload":"10-30 hrs\/week","job_status":"Open","date_created":"2016-10-29T15:23:43+0000","url":"http:\/\/www.upwork.com\/jobs\/~01e66d5f7e8aa751c8","client":{"country":"United Kingdom","feedback":5,"reviews_count":2,"jobs_posted":11,"past_hires":7,"payment_verification_status":"VERIFIED"}}