{"id":"~01ebca7fdea729f5e0","title":"I need a graphic designer to design 3 interior book pages for an Arabic journal","snippet":"We are working on an Arabic themed journal. \nThe journal is for 3 years (1 day\/3 years on one page) and includes Arabic illustrations on every page. \n\nWe are looking for an innovative design of the pages that reflects the Arabic theme while still giving enough space for the user to write in.  \n\nThe journal design should evoke a desire in people to grab the book and touch it, „because it’s so shiny and beautiful.“ Think: understatement, high quality.\nIt will be the users' Arabic retreat from the stress of every day life.\n\nPlease read the Design Brief that we attach below. It includes the specs of the project, example images, a link to a Pinterest board with more images, the files with the sample text.\n\nWe provide a Word document for you with 3 versions of the content for the core double page; Intention setting page and Review page: English, Arabic-English and Arabic.\n\nWe will review your draft designs in PDF.\n\nThe final version, we expect in three (3) InDesign files, each with templates for\n- intention setting page \n- core page (double page; see sketch)\n- review page\n\nThe three files will be:\na) English Version;\nb) Arabic Version; and\nc) English\/Arabic Version\n\nAn example translation to Arabic is included. If you cannot read Arabic, don't worry. Just keep in mind that Arabic writing flows from right to left and the book in version b) will also be read from right to left -- inverse the design to what you might be used to.","category2":"Design & Creative","subcategory2":"Graphic Design","skills":["adobe-illustrator","adobe-indesign","graphic-design","print-design"],"job_type":"Fixed","budget":300,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-30T09:51:36+0000","url":"http:\/\/www.upwork.com\/jobs\/~01ebca7fdea729f5e0","client":{"country":"Qatar","feedback":0,"reviews_count":0,"jobs_posted":0,"past_hires":0,"payment_verification_status":"UNKNOWN"}}