{"id":"~01e2ded3e61f8deb22","title":"Looking for the Yoda of online copywriting to create badass copy that sells for Amazon review niche site","snippet":"Are you the Yoda of online copywriting? Can you write copy so badass that you could sell karate lessons to Chuck Norris? If so, we need to talk...\n\nMy partners and I are currently in the process of creating an Amazon review niche site for hunting boots and we need the Yoda of online copywriting to write 100% original copy that SELLS. \n\nSpecifically, we need 7 separate reviews of specific Amazon hunting boots that are a minimum of 1,000 words each. \n\nThis could very well become a long term gig for the right badass copywriter. But I'll get to that soon. First...\n\nLet me be very clear: \n\nBy day my partners and I are award winning direct mail copywriters that work for one of the top agencies in the country. \n\nSo yeah, we know creative copy when we see it. \n\nWhich probably makes you wonder...\n\nWhy in the world aren't you writing this content for yourselves?\n\nGood question. Here's the simple answer. \n\nTime. Or lack thereof. \n\nManaging copy and fundraising for 15 well known nonprofits takes up almost all our time. \n\nPlus, my fellow copy kings and I have limited knowledge of online copywriting, pitches, etc. \n\nSo, we put two and two together and decided it would be more profitable and expedient for us to seek out the Yoda, Chuck Norris, Superman (enter your favorite badass hero here) of online Amazon review copywriting to do it for us. \n\nThat brings me to your mission, should you be worthy of the calling.\n\nHERE'S WHAT WE ARE LOOKING FOR:\n\n1.) We need an absolutely badass copywriter. Someone who is a seasoned veteran of writing 100% original, grab you by the balls copy that sells. \n\nLet me put it this way - we need someone who can write copy so compelling, they could convince Chuck Norris to purchase karate lessons. Get the idea?\n\n2. You MUST be someone who knows Amazon like the back of your hand. Most of the research about the products we're asking you to review comes from Amazon's reviews from individual customers. \n\n2.)We expect edgy, humorous copy. \n\nNot your standard \"these hunting boots are perfect for any hunter because...\" \nTALK ABOUT BORING! No, we expect much more. Don't be afraid to cuss a little (after all, our website is called badass hunting boots). If we've learned anything from our day jobs it's that standing out with unique content is a good thing. Actually, it's required. \n\n3.) We expect 100% original copy and content. \n\nThe internet is full of recycled garbage reviews that at best don't get you ranked. And at worst get Google to slap you with a \"thin content\" hit. My partners and I can sense plagiarism a mile away. Don't try it. We want this to be a long term relationship with the right person so you'll only be shooting yourself in the foot by doing so. \n\nWe also understand that flooding articles with keywords is no longer a shortcut to ranking on the top page. Only quality content does that. \n\n4.) We expect of minimum of 1,000 words per review with headlines that grab the eyes and tell the whole story for skimmers. \n\nIf you're a seasoned pro at writing reviews, you know why they need to be long. \n\nIF YOU THINK YOU CAN HANDLE THE JOB, HERE'S WHAT WE NEED FROM YOU...\n\n1.) We'd like to see a portfolio of similar Amazon reviews you've done. And, if possible, recommendations from your clients. \n\n2.) Let's see what you've got - tell me what headline you'd use to start your review of our first hunting boot - the Irish Setter Men's 2870 Vaprtrek Waterproof 8in Hunting boot. \n\nIt's a badass boot. Sell it to me. \n\n3.) Once we choose our next apprentice, we'll get in touch with you with all the details you need to get 'er done. \n\nMay the force be with you...\n\n\n\n\n\n\n","category2":"Writing","subcategory2":"Copywriting","skills":[],"job_type":"Hourly","budget":0,"duration":"Less than 1 month","workload":"10-30 hrs\/week","job_status":"Open","date_created":"2016-10-30T21:48:14+0000","url":"http:\/\/www.upwork.com\/jobs\/~01e2ded3e61f8deb22","client":{"country":"United States","feedback":0,"reviews_count":0,"jobs_posted":0,"past_hires":0,"payment_verification_status":"UNKNOWN"}}