{"id":"~01f38ec4c293aa05f3","title":"Need help calling businesses to collect industry data","snippet":"I run a trade association and we are reaching out to members of the industry to collect the answers to 10 questions. I have done several test calls myself and they are straightforward as long as someone answers the phone :-) The businesses are shared workspaces - they should have a manager that answers the phone and can easily answer each of the questions. If they only have one person on staff at a time, the staff person might be busy with a member and not answer the phone so you'd have to try back. I have a list of locations to call, a script and a list of questions. Please see this document - script on tab 1, questions on tab 2. I have an initial list of 50 locations to call and will be adding more - looking for a minimum of 300 responses. https:\/\/docs.google.com\/a\/globalworkspace.org\/spreadsheets\/d\/1359MTtkuaY3uOdsdRS40bgro2Qqwev80g3Dtsc3IvEw\/edit?usp=sharing\n\nThis is NOT a sales call. We are collecting basic information that is not considered confidential or sensitive. The test calls I performed were easy and friendly and dare I say fun but maybe that's because I'm in the industry :-)\n\nLooking to complete this work before Thanksgiving at the latest. We may have ongoing projects.\n\nOnce hired, I will jump on the phone or Skype with you and provide more context for the survey, answer questions, etc. I will also be available for questions\/support as needed although based on my test calls, this should be pretty straightforward.","category2":"Sales & Marketing","subcategory2":"Market & Customer Research","skills":["customer-service","telephone-skills"],"job_type":"Hourly","budget":0,"duration":"Less than 1 month","workload":"10-30 hrs\/week","job_status":"Open","date_created":"2016-10-28T23:47:31+0000","url":"http:\/\/www.upwork.com\/jobs\/~01f38ec4c293aa05f3","client":{"country":"United States","feedback":5,"reviews_count":12,"jobs_posted":16,"past_hires":14,"payment_verification_status":"VERIFIED"}}