{"id":"~01f80c7da390f37382","title":"FB app game (mobile enabled)","snippet":"FB app game (mobile enabled) \nDelivery : 30th november\n\nObjectives\n- Increase fan acquisition on Facebook\n- Allow fans (and non-fans) to interact through fun related mini games and augment\nAirAsia’s fun and bold personality through gamification.\n\nTimeline:  To be advised\n\nOverview and concept of game\n- Similar to Bishi Bashi (Example:  https:\/\/www.youtube.com\/watch?v=foi6_yA4Xwk ) or the mobile version of ‘Hardest Game Ever 2’\n- 5 levels of mini simple games + 3 bonus levels where players can earn points to proceed to the next level\n\nUser journey (map of journey)-\nStep 1:  Fans will go to FB and view contest post - which will link to the app\/tab (has to be mobile enabled)\nStep 2:  Login using FB account\nStep 3:  Play the game(s), go through each levels.\n- Player has to complete a certain amount of points to unlock the next level. I.e. once the player passes the 1st round, they can unlock the 2nd round and continue playing\n- If the player is unable to pass the round, they cannot unlock the next round and can have the option of sharing the game on their wall to earn more points or recommend it to 10 friends to win points and Leader-board comes up\n- If players are unable to reach to the next level, they can recommend\/share the game with up to 2\/3\/4\/5 and so on friends and win points.\n- The more points a player gets, the higher chances of winning the prizes (leaderboard has to be set up)\n- Once the players unlock all 5 levels, they have to hit a certain amount of points to unlock 3 bonus levels\n- Completing any bonus levels will allow them to win DOUBLE points\nStep 4:  If player finishes game, leaderboard appears, and they can replay any levels to beat the high score. Players can also share\/recommend the game to more friends to earn more points.\n\nLook and feel of the game\n- Birthday themed\n- Fun, interesting illustrations like ‘The Hardest Game Ever 2’\n\n5 mini games :\nLevel 1 - Fill up the Balloons\n- Tap the Red button repeatedly to fill the Balloon up in the shortest\namount of time (mobile\/desktop)\n- Can look something like http:\/\/gph.is\/1KG0fFq\n\nLevel 2 - Blow-out the candles!\n- Blow out the candles (based on the colours) as fast as possible\n- Candles have to be in red, pink, (one more colour) (no yellow or orange)\n\nLevel 3 - Avoid the Morning Crowd\n- Tap left and right alternatively to avoid the morning rush at the airport and get to your\ngate!\n- Obstacles will be be ‘people’\n- Users do not have to collect anything as they avoid people\n\nLevel 4 - Stamp the passports!\n- Stamp for exactly 37 passenger’s passport in the shortest time possible.\n\nLevel 5 - FINAL\n- Use alternate (left and right) to climb up the stairs to reach the plane!\n\nBONUS Level 1 (WIN DOUBLE POINTS)\n- Fill up the seats in the shortest time possible, based on the colours of the passenger’s shirt\nand the colour of the seats\n- 3 colours: Red, White, Green\n\nBONUS Level 2 (WIN DOUBLE POINTS)\n- Fill the dotted luggage piles as fast as you can!\n\nBONUS Level 3 (WIN DOUBLE POINTS)\n- Match the bears collections based on the colour of the boxes","category2":"Web, Mobile & Software Dev","subcategory2":"Game Development","skills":["facebook-games-development","game-design","game-development","game-programming"],"job_type":"Fixed","budget":5000,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-28T02:52:05+0000","url":"http:\/\/www.upwork.com\/jobs\/~01f80c7da390f37382","client":{"country":"Singapore","feedback":4.8666285596,"reviews_count":8,"jobs_posted":41,"past_hires":16,"payment_verification_status":"VERIFIED"}}