{"id":"~01ff1c79a45c849be9","title":"i Need an Experience Data Analys","snippet":"Evaluate daily cash position and determine cash available for investment\nCoordinate trading, funds transfer and settlement activities\nAssist in the projection and monitoring of investment income on a monthly, quarterly and annual basis\nAssist Senior Investment Analyst in performing portfolio analytics including investment income variance reports, investment fee analysis and reconciliations, and strategic investment assessment\nPerform investment administration duties including but not limited to: completion of all account opening documents for reserve and pension accounts, maintenance and update of investment guidelines, collection and review of SSAE 16’s, QIB’s, ADV and corporate action forms. Completion of all manager collected OTTI and other investment accounting information requests. \nUnimpeachable character, strong values orientation, and a cultural fit with an entrepreneurial venture\nEvaluate daily cash position and determine cash available for investment\nIntellectual curiosity, a strong work ethic and commitment to a superior work product\nAssist in the projection and monitoring of investment income on a monthly, quarterly and annual basis\nExperience closing project finance deals in the resource efficiency space\nExperience managing projects from start to finish\nProven ability to work with diverse groups of people in challenging and complex endeavors\nStrong analytical and problem solving skills\nSuperior interpersonal skills\nDetail orientation and meticulousness with a constant desire for timeliness and accuracy of data; ability to manage quality, accuracy and consistency of work products\nResourceful and creative in approach to research and problem-solving\nProficiency with Microsoft Office Suite, including Excel, PowerPoint, and Word\nAbility to synthesize and clearly communicate findings of analyses\nAbility to work well in a dynamic and rapidly changing environment\nMust be proactive and have a strong personal initiative and desire to succeed in an entrepreneurial environment.\nPerform market research and writing of market demographic, economic conditions and area overviews for investment offerings\nProven ability to balance multiple assignments and meet strict deadlines\nBachelors degree with high academic achievement\nGlowing references from prior employers and peers\nRecord of high academic achievement\nEngineering or other technical degree is a plus.\nDemonstrate knowledge of the roles traditional and alternative asset classes serve in a diversified portfolio","category2":"Data Science & Analytics","subcategory2":"Other - Data Science & Analytics","skills":[],"job_type":"Fixed","budget":2500,"duration":null,"workload":null,"job_status":"Open","date_created":"2016-10-28T16:24:07+0000","url":"http:\/\/www.upwork.com\/jobs\/~01ff1c79a45c849be9","client":{"country":"United States","feedback":0,"reviews_count":0,"jobs_posted":0,"past_hires":0,"payment_verification_status":"UNKNOWN"}}